apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/****************************************************************************
 * arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_EFUSE_H
#define __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_EFUSE_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s2_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* EFUSE_PGM_DATA0_REG register
 * Register 0 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA0_REG (DR_REG_EFUSE_BASE + 0x0)

/* EFUSE_PGM_DATA_0 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 0th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_0    0xFFFFFFFF
#define EFUSE_PGM_DATA_0_M  (EFUSE_PGM_DATA_0_V << EFUSE_PGM_DATA_0_S)
#define EFUSE_PGM_DATA_0_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_0_S  0

/* EFUSE_PGM_DATA1_REG register
 * Register 1 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA1_REG (DR_REG_EFUSE_BASE + 0x4)

/* EFUSE_PGM_DATA_1 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 1th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_1    0xFFFFFFFF
#define EFUSE_PGM_DATA_1_M  (EFUSE_PGM_DATA_1_V << EFUSE_PGM_DATA_1_S)
#define EFUSE_PGM_DATA_1_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_1_S  0

/* EFUSE_PGM_DATA2_REG register
 * Register 2 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA2_REG (DR_REG_EFUSE_BASE + 0x8)

/* EFUSE_PGM_DATA_2 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 2th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_2    0xFFFFFFFF
#define EFUSE_PGM_DATA_2_M  (EFUSE_PGM_DATA_2_V << EFUSE_PGM_DATA_2_S)
#define EFUSE_PGM_DATA_2_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_2_S  0

/* EFUSE_PGM_DATA3_REG register
 * Register 3 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA3_REG (DR_REG_EFUSE_BASE + 0xc)

/* EFUSE_PGM_DATA_3 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 3th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_3    0xFFFFFFFF
#define EFUSE_PGM_DATA_3_M  (EFUSE_PGM_DATA_3_V << EFUSE_PGM_DATA_3_S)
#define EFUSE_PGM_DATA_3_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_3_S  0

/* EFUSE_PGM_DATA4_REG register
 * Register 4 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA4_REG (DR_REG_EFUSE_BASE + 0x10)

/* EFUSE_PGM_DATA_4 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 4th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_4    0xFFFFFFFF
#define EFUSE_PGM_DATA_4_M  (EFUSE_PGM_DATA_4_V << EFUSE_PGM_DATA_4_S)
#define EFUSE_PGM_DATA_4_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_4_S  0

/* EFUSE_PGM_DATA5_REG register
 * Register 5 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA5_REG (DR_REG_EFUSE_BASE + 0x14)

/* EFUSE_PGM_DATA_5 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 5th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_5    0xFFFFFFFF
#define EFUSE_PGM_DATA_5_M  (EFUSE_PGM_DATA_5_V << EFUSE_PGM_DATA_5_S)
#define EFUSE_PGM_DATA_5_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_5_S  0

/* EFUSE_PGM_DATA6_REG register
 * Register 6 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA6_REG (DR_REG_EFUSE_BASE + 0x18)

/* EFUSE_PGM_DATA_6 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 6th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_6    0xFFFFFFFF
#define EFUSE_PGM_DATA_6_M  (EFUSE_PGM_DATA_6_V << EFUSE_PGM_DATA_6_S)
#define EFUSE_PGM_DATA_6_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_6_S  0

/* EFUSE_PGM_DATA7_REG register
 * Register 7 that stores data to be programmed.
 */

#define EFUSE_PGM_DATA7_REG (DR_REG_EFUSE_BASE + 0x1c)

/* EFUSE_PGM_DATA_7 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 7th 32-bit data to be programmed.
 */

#define EFUSE_PGM_DATA_7    0xFFFFFFFF
#define EFUSE_PGM_DATA_7_M  (EFUSE_PGM_DATA_7_V << EFUSE_PGM_DATA_7_S)
#define EFUSE_PGM_DATA_7_V  0xFFFFFFFF
#define EFUSE_PGM_DATA_7_S  0

/* EFUSE_PGM_CHECK_VALUE0_REG register
 * Register 0 that stores the RS code to be programmed.
 */

#define EFUSE_PGM_CHECK_VALUE0_REG (DR_REG_EFUSE_BASE + 0x20)

/* EFUSE_PGM_RS_DATA_0 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 0th 32-bit RS code to be programmed.
 */

#define EFUSE_PGM_RS_DATA_0    0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_0_M  (EFUSE_PGM_RS_DATA_0_V << EFUSE_PGM_RS_DATA_0_S)
#define EFUSE_PGM_RS_DATA_0_V  0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_0_S  0

/* EFUSE_PGM_CHECK_VALUE1_REG register
 * Register 1 that stores the RS code to be programmed.
 */

#define EFUSE_PGM_CHECK_VALUE1_REG (DR_REG_EFUSE_BASE + 0x24)

/* EFUSE_PGM_RS_DATA_1 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 1th 32-bit RS code to be programmed.
 */

#define EFUSE_PGM_RS_DATA_1    0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_1_M  (EFUSE_PGM_RS_DATA_1_V << EFUSE_PGM_RS_DATA_1_S)
#define EFUSE_PGM_RS_DATA_1_V  0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_1_S  0

/* EFUSE_PGM_CHECK_VALUE2_REG register
 * Register 2 that stores the RS code to be programmed.
 */

#define EFUSE_PGM_CHECK_VALUE2_REG (DR_REG_EFUSE_BASE + 0x28)

/* EFUSE_PGM_RS_DATA_2 : R/W; bitpos: [31:0]; default: 0;
 * The content of the 2th 32-bit RS code to be programmed.
 */

#define EFUSE_PGM_RS_DATA_2    0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_2_M  (EFUSE_PGM_RS_DATA_2_V << EFUSE_PGM_RS_DATA_2_S)
#define EFUSE_PGM_RS_DATA_2_V  0xFFFFFFFF
#define EFUSE_PGM_RS_DATA_2_S  0

