apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_RD_WR_DIS_REG register
 * Register 0 of BLOCK0.
 */

#define EFUSE_RD_WR_DIS_REG (DR_REG_EFUSE_BASE + 0x2c)

/* EFUSE_WR_DIS : RO; bitpos: [31:0]; default: 0;
 * Disables programming of individual eFuses.
 */

#define EFUSE_WR_DIS    0xFFFFFFFF
#define EFUSE_WR_DIS_M  (EFUSE_WR_DIS_V << EFUSE_WR_DIS_S)
#define EFUSE_WR_DIS_V  0xFFFFFFFF
#define EFUSE_WR_DIS_S  0

/* EFUSE_RD_REPEAT_DATA0_REG register
 * Register 1 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_DATA0_REG (DR_REG_EFUSE_BASE + 0x30)

/* EFUSE_VDD_SPI_DREFH : RO; bitpos: [31:30]; default: 0;
 * SPI regulator high voltage reference.
 */

#define EFUSE_VDD_SPI_DREFH    0x00000003
#define EFUSE_VDD_SPI_DREFH_M  (EFUSE_VDD_SPI_DREFH_V << EFUSE_VDD_SPI_DREFH_S)
#define EFUSE_VDD_SPI_DREFH_V  0x00000003
#define EFUSE_VDD_SPI_DREFH_S  30

/* EFUSE_VDD_SPI_MODECURLIM : RO; bitpos: [29]; default: 0;
 * SPI regulator switches current limit mode.
 */

#define EFUSE_VDD_SPI_MODECURLIM    (BIT(29))
#define EFUSE_VDD_SPI_MODECURLIM_M  (EFUSE_VDD_SPI_MODECURLIM_V << EFUSE_VDD_SPI_MODECURLIM_S)
#define EFUSE_VDD_SPI_MODECURLIM_V  0x00000001
#define EFUSE_VDD_SPI_MODECURLIM_S  29

/* EFUSE_RPT4_RESERVED0 : RO; bitpos: [28:27]; default: 0;
 * Reserved (used for four backups method).
 */

#define EFUSE_RPT4_RESERVED0    0x00000003
#define EFUSE_RPT4_RESERVED0_M  (EFUSE_RPT4_RESERVED0_V << EFUSE_RPT4_RESERVED0_S)
#define EFUSE_RPT4_RESERVED0_V  0x00000003
#define EFUSE_RPT4_RESERVED0_S  27

/* EFUSE_USB_FORCE_NOPERSIST : RO; bitpos: [26]; default: 0;
 * If set, forces USB BVALID to 1.
 */

#define EFUSE_USB_FORCE_NOPERSIST    (BIT(26))
#define EFUSE_USB_FORCE_NOPERSIST_M  (EFUSE_USB_FORCE_NOPERSIST_V << EFUSE_USB_FORCE_NOPERSIST_S)
#define EFUSE_USB_FORCE_NOPERSIST_V  0x00000001
#define EFUSE_USB_FORCE_NOPERSIST_S  26

/* EFUSE_EXT_PHY_ENABLE : RO; bitpos: [25]; default: 0;
 * Set this bit to enable external USB PHY.
 */

#define EFUSE_EXT_PHY_ENABLE    (BIT(25))
#define EFUSE_EXT_PHY_ENABLE_M  (EFUSE_EXT_PHY_ENABLE_V << EFUSE_EXT_PHY_ENABLE_S)
#define EFUSE_EXT_PHY_ENABLE_V  0x00000001
#define EFUSE_EXT_PHY_ENABLE_S  25

/* EFUSE_USB_EXCHG_PINS : RO; bitpos: [24]; default: 0;
 * Set this bit to exchange USB D+ and D- pins.
 */

#define EFUSE_USB_EXCHG_PINS    (BIT(24))
#define EFUSE_USB_EXCHG_PINS_M  (EFUSE_USB_EXCHG_PINS_V << EFUSE_USB_EXCHG_PINS_S)
#define EFUSE_USB_EXCHG_PINS_V  0x00000001
#define EFUSE_USB_EXCHG_PINS_S  24

/* EFUSE_USB_DREFL : RO; bitpos: [23:22]; default: 0;
 * Controls single-end input threshold vrefl, 0.8 V to 1.04 V with step of
 * 80 mV, stored in eFuse.
 */

#define EFUSE_USB_DREFL    0x00000003
#define EFUSE_USB_DREFL_M  (EFUSE_USB_DREFL_V << EFUSE_USB_DREFL_S)
#define EFUSE_USB_DREFL_V  0x00000003
#define EFUSE_USB_DREFL_S  22

/* EFUSE_USB_DREFH : RO; bitpos: [21:20]; default: 0;
 * Controls single-end input threshold vrefh, 1.76 V to 2 V with step of 80
 * mV, stored in eFuse.
 */

#define EFUSE_USB_DREFH    0x00000003
#define EFUSE_USB_DREFH_M  (EFUSE_USB_DREFH_V << EFUSE_USB_DREFH_S)
#define EFUSE_USB_DREFH_V  0x00000003
#define EFUSE_USB_DREFH_S  20

/* EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT : RO; bitpos: [19]; default: 0;
 * Disables flash encryption when in download boot modes.
 */

#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT    (BIT(19))
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_M  (EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_V << EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_S)
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_S  19

/* EFUSE_HARD_DIS_JTAG : RO; bitpos: [18]; default: 0;
 * Hardware disables JTAG permanently.
 */

#define EFUSE_HARD_DIS_JTAG    (BIT(18))
#define EFUSE_HARD_DIS_JTAG_M  (EFUSE_HARD_DIS_JTAG_V << EFUSE_HARD_DIS_JTAG_S)
#define EFUSE_HARD_DIS_JTAG_V  0x00000001
#define EFUSE_HARD_DIS_JTAG_S  18

/* EFUSE_SOFT_DIS_JTAG : RO; bitpos: [17]; default: 0;
 * Software disables JTAG. When software disabled, JTAG can be activated
 * temporarily by HMAC peripheral.
 */

#define EFUSE_SOFT_DIS_JTAG    (BIT(17))
#define EFUSE_SOFT_DIS_JTAG_M  (EFUSE_SOFT_DIS_JTAG_V << EFUSE_SOFT_DIS_JTAG_S)
#define EFUSE_SOFT_DIS_JTAG_V  0x00000001
#define EFUSE_SOFT_DIS_JTAG_S  17

/* EFUSE_DIS_EFUSE_ATE_WR : RO; bitpos: [16]; default: 0; */

#define EFUSE_DIS_EFUSE_ATE_WR    (BIT(16))
#define EFUSE_DIS_EFUSE_ATE_WR_M  (EFUSE_DIS_EFUSE_ATE_WR_V << EFUSE_DIS_EFUSE_ATE_WR_S)
#define EFUSE_DIS_EFUSE_ATE_WR_V  0x00000001
#define EFUSE_DIS_EFUSE_ATE_WR_S  16

/* EFUSE_DIS_BOOT_REMAP : RO; bitpos: [15]; default: 0;
 * Disables capability to Remap RAM to ROM address space.
 */

#define EFUSE_DIS_BOOT_REMAP    (BIT(15))
#define EFUSE_DIS_BOOT_REMAP_M  (EFUSE_DIS_BOOT_REMAP_V << EFUSE_DIS_BOOT_REMAP_S)
#define EFUSE_DIS_BOOT_REMAP_V  0x00000001
#define EFUSE_DIS_BOOT_REMAP_S  15

/* EFUSE_DIS_CAN : RO; bitpos: [14]; default: 0;
 * Set this bit to disable CAN function.
 */

#define EFUSE_DIS_CAN    (BIT(14))
#define EFUSE_DIS_CAN_M  (EFUSE_DIS_CAN_V << EFUSE_DIS_CAN_S)
#define EFUSE_DIS_CAN_V  0x00000001
#define EFUSE_DIS_CAN_S  14

/* EFUSE_DIS_USB : RO; bitpos: [13]; default: 0;
 * Set this bit to disable USB function.
 */

#define EFUSE_DIS_USB    (BIT(13))
#define EFUSE_DIS_USB_M  (EFUSE_DIS_USB_V << EFUSE_DIS_USB_S)
#define EFUSE_DIS_USB_V  0x00000001
#define EFUSE_DIS_USB_S  13

/* EFUSE_DIS_FORCE_DOWNLOAD : RO; bitpos: [12]; default: 0;
 * Set this bit to disable the function that forces chip into download mode.
 */

#define EFUSE_DIS_FORCE_DOWNLOAD    (BIT(12))
#define EFUSE_DIS_FORCE_DOWNLOAD_M  (EFUSE_DIS_FORCE_DOWNLOAD_V << EFUSE_DIS_FORCE_DOWNLOAD_S)
#define EFUSE_DIS_FORCE_DOWNLOAD_V  0x00000001
#define EFUSE_DIS_FORCE_DOWNLOAD_S  12

/* EFUSE_DIS_DOWNLOAD_DCACHE : RO; bitpos: [11]; default: 0;
 * Disables Dcache when SoC is in Download mode.
 */

#define EFUSE_DIS_DOWNLOAD_DCACHE    (BIT(11))
#define EFUSE_DIS_DOWNLOAD_DCACHE_M  (EFUSE_DIS_DOWNLOAD_DCACHE_V << EFUSE_DIS_DOWNLOAD_DCACHE_S)
#define EFUSE_DIS_DOWNLOAD_DCACHE_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_DCACHE_S  11

/* EFUSE_DIS_DOWNLOAD_ICACHE : RO; bitpos: [10]; default: 0;
 * Disables Icache when SoC is in Download mode.
 */

