apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_DIS_DOWNLOAD_ICACHE    (BIT(10))
#define EFUSE_DIS_DOWNLOAD_ICACHE_M  (EFUSE_DIS_DOWNLOAD_ICACHE_V << EFUSE_DIS_DOWNLOAD_ICACHE_S)
#define EFUSE_DIS_DOWNLOAD_ICACHE_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_ICACHE_S  10

/* EFUSE_DIS_DCACHE : RO; bitpos: [9]; default: 0;
 * Set this bit to disable Dcache.
 */

#define EFUSE_DIS_DCACHE    (BIT(9))
#define EFUSE_DIS_DCACHE_M  (EFUSE_DIS_DCACHE_V << EFUSE_DIS_DCACHE_S)
#define EFUSE_DIS_DCACHE_V  0x00000001
#define EFUSE_DIS_DCACHE_S  9

/* EFUSE_DIS_ICACHE : RO; bitpos: [8]; default: 0;
 * Set this bit to disable Icache.
 */

#define EFUSE_DIS_ICACHE    (BIT(8))
#define EFUSE_DIS_ICACHE_M  (EFUSE_DIS_ICACHE_V << EFUSE_DIS_ICACHE_S)
#define EFUSE_DIS_ICACHE_V  0x00000001
#define EFUSE_DIS_ICACHE_S  8

/* EFUSE_DIS_RTC_RAM_BOOT : RO; bitpos: [7]; default: 0;
 * Set this bit to disable boot from RTC RAM.
 */

#define EFUSE_DIS_RTC_RAM_BOOT    (BIT(7))
#define EFUSE_DIS_RTC_RAM_BOOT_M  (EFUSE_DIS_RTC_RAM_BOOT_V << EFUSE_DIS_RTC_RAM_BOOT_S)
#define EFUSE_DIS_RTC_RAM_BOOT_V  0x00000001
#define EFUSE_DIS_RTC_RAM_BOOT_S  7

/* EFUSE_RD_DIS : RO; bitpos: [6:0]; default: 0;
 * Disables software reading from individual eFuse blocks (BLOCK4-10).
 */

#define EFUSE_RD_DIS    0x0000007F
#define EFUSE_RD_DIS_M  (EFUSE_RD_DIS_V << EFUSE_RD_DIS_S)
#define EFUSE_RD_DIS_V  0x0000007F
#define EFUSE_RD_DIS_S  0

/* EFUSE_RD_REPEAT_DATA1_REG register
 * Register 2 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_DATA1_REG (DR_REG_EFUSE_BASE + 0x34)

/* EFUSE_KEY_PURPOSE_1 : RO; bitpos: [31:28]; default: 0;
 * Purpose of KEY1. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_1    0x0000000F
#define EFUSE_KEY_PURPOSE_1_M  (EFUSE_KEY_PURPOSE_1_V << EFUSE_KEY_PURPOSE_1_S)
#define EFUSE_KEY_PURPOSE_1_V  0x0000000F
#define EFUSE_KEY_PURPOSE_1_S  28

/* EFUSE_KEY_PURPOSE_0 : RO; bitpos: [27:24]; default: 0;
 * Purpose of KEY0. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_0    0x0000000F
#define EFUSE_KEY_PURPOSE_0_M  (EFUSE_KEY_PURPOSE_0_V << EFUSE_KEY_PURPOSE_0_S)
#define EFUSE_KEY_PURPOSE_0_V  0x0000000F
#define EFUSE_KEY_PURPOSE_0_S  24

/* EFUSE_SECURE_BOOT_KEY_REVOKE2 : RO; bitpos: [23]; default: 0;
 * If set, revokes use of secure boot key digest 2.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE2    (BIT(23))
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_M  (EFUSE_SECURE_BOOT_KEY_REVOKE2_V << EFUSE_SECURE_BOOT_KEY_REVOKE2_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_S  23

/* EFUSE_SECURE_BOOT_KEY_REVOKE1 : RO; bitpos: [22]; default: 0;
 * If set, revokes use of secure boot key digest 1.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE1    (BIT(22))
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_M  (EFUSE_SECURE_BOOT_KEY_REVOKE1_V << EFUSE_SECURE_BOOT_KEY_REVOKE1_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_S  22

/* EFUSE_SECURE_BOOT_KEY_REVOKE0 : RO; bitpos: [21]; default: 0;
 * If set, revokes use of secure boot key digest 0.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE0    (BIT(21))
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_M  (EFUSE_SECURE_BOOT_KEY_REVOKE0_V << EFUSE_SECURE_BOOT_KEY_REVOKE0_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_S  21

/* EFUSE_SPI_BOOT_CRYPT_CNT : RO; bitpos: [20:18]; default: 0;
 * Enables encryption and decryption, when an SPI boot mode is set. Feature
 * is enabled 1 or 3 bits are set in the eFuse, disabled otherwise.
 */

#define EFUSE_SPI_BOOT_CRYPT_CNT    0x00000007
#define EFUSE_SPI_BOOT_CRYPT_CNT_M  (EFUSE_SPI_BOOT_CRYPT_CNT_V << EFUSE_SPI_BOOT_CRYPT_CNT_S)
#define EFUSE_SPI_BOOT_CRYPT_CNT_V  0x00000007
#define EFUSE_SPI_BOOT_CRYPT_CNT_S  18

/* EFUSE_WDT_DELAY_SEL : RO; bitpos: [17:16]; default: 0;
 * Selects RTC watchdog timeout threshold at startup. 0: 40,000 slow clock
 * cycles; 1: 80,000 slow clock cycles; 2: 160,000 slow clock cycles; 3:
 * 320,000 slow clock cycles.
 */

#define EFUSE_WDT_DELAY_SEL    0x00000003
#define EFUSE_WDT_DELAY_SEL_M  (EFUSE_WDT_DELAY_SEL_V << EFUSE_WDT_DELAY_SEL_S)
#define EFUSE_WDT_DELAY_SEL_V  0x00000003
#define EFUSE_WDT_DELAY_SEL_S  16

/* EFUSE_VDD_SPI_DCAP : RO; bitpos: [15:14]; default: 0;
 * Prevents SPI regulator from overshoot.
 */

#define EFUSE_VDD_SPI_DCAP    0x00000003
#define EFUSE_VDD_SPI_DCAP_M  (EFUSE_VDD_SPI_DCAP_V << EFUSE_VDD_SPI_DCAP_S)
#define EFUSE_VDD_SPI_DCAP_V  0x00000003
#define EFUSE_VDD_SPI_DCAP_S  14

/* EFUSE_VDD_SPI_INIT : RO; bitpos: [13:12]; default: 0;
 * Adds resistor from LDO output to ground. 0: no resistance; 1: 6 K; 2: 4
 * K; 3: 2 K.
 */

#define EFUSE_VDD_SPI_INIT    0x00000003
#define EFUSE_VDD_SPI_INIT_M  (EFUSE_VDD_SPI_INIT_V << EFUSE_VDD_SPI_INIT_S)
#define EFUSE_VDD_SPI_INIT_V  0x00000003
#define EFUSE_VDD_SPI_INIT_S  12

/* EFUSE_VDD_SPI_DCURLIM : RO; bitpos: [11:9]; default: 0;
 * Tunes the current limit threshold of SPI regulator when tieh=0, about 800
 * mA/(8+d).
 */

#define EFUSE_VDD_SPI_DCURLIM    0x00000007
#define EFUSE_VDD_SPI_DCURLIM_M  (EFUSE_VDD_SPI_DCURLIM_V << EFUSE_VDD_SPI_DCURLIM_S)
#define EFUSE_VDD_SPI_DCURLIM_V  0x00000007
#define EFUSE_VDD_SPI_DCURLIM_S  9

/* EFUSE_VDD_SPI_ENCURLIM : RO; bitpos: [8]; default: 0;
 * Set SPI regulator to 1 to enable output current limit.
 */

#define EFUSE_VDD_SPI_ENCURLIM    (BIT(8))
#define EFUSE_VDD_SPI_ENCURLIM_M  (EFUSE_VDD_SPI_ENCURLIM_V << EFUSE_VDD_SPI_ENCURLIM_S)
#define EFUSE_VDD_SPI_ENCURLIM_V  0x00000001
#define EFUSE_VDD_SPI_ENCURLIM_S  8

/* EFUSE_VDD_SPI_EN_INIT : RO; bitpos: [7]; default: 0;
 * Set SPI regulator to 0 to configure init[1:0]=0.
 */

#define EFUSE_VDD_SPI_EN_INIT    (BIT(7))
#define EFUSE_VDD_SPI_EN_INIT_M  (EFUSE_VDD_SPI_EN_INIT_V << EFUSE_VDD_SPI_EN_INIT_S)
#define EFUSE_VDD_SPI_EN_INIT_V  0x00000001
#define EFUSE_VDD_SPI_EN_INIT_S  7

/* EFUSE_VDD_SPI_FORCE : RO; bitpos: [6]; default: 0;
 * Set this bit to use XPD_VDD_PSI_REG and VDD_SPI_TIEH to configure VDD_SPI
 * LDO.
 */

#define EFUSE_VDD_SPI_FORCE    (BIT(6))
#define EFUSE_VDD_SPI_FORCE_M  (EFUSE_VDD_SPI_FORCE_V << EFUSE_VDD_SPI_FORCE_S)
#define EFUSE_VDD_SPI_FORCE_V  0x00000001
#define EFUSE_VDD_SPI_FORCE_S  6

/* EFUSE_VDD_SPI_TIEH : RO; bitpos: [5]; default: 0;
 * If VDD_SPI_FORCE is 1, determines VDD_SPI voltage. 0: VDD_SPI connects to
 * 1.8 V LDO; 1: VDD_SPI connects to VDD_RTC_IO.
 */

