apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_VDD_SPI_TIEH    (BIT(5))
#define EFUSE_VDD_SPI_TIEH_M  (EFUSE_VDD_SPI_TIEH_V << EFUSE_VDD_SPI_TIEH_S)
#define EFUSE_VDD_SPI_TIEH_V  0x00000001
#define EFUSE_VDD_SPI_TIEH_S  5

/* EFUSE_VDD_SPI_XPD : RO; bitpos: [4]; default: 0;
 * If VDD_SPI_FORCE is 1, this value determines if the VDD_SPI regulator is
 * powered on.
 */

#define EFUSE_VDD_SPI_XPD    (BIT(4))
#define EFUSE_VDD_SPI_XPD_M  (EFUSE_VDD_SPI_XPD_V << EFUSE_VDD_SPI_XPD_S)
#define EFUSE_VDD_SPI_XPD_V  0x00000001
#define EFUSE_VDD_SPI_XPD_S  4

/* EFUSE_VDD_SPI_DREFL : RO; bitpos: [3:2]; default: 0;
 * SPI regulator low voltage reference.
 */

#define EFUSE_VDD_SPI_DREFL    0x00000003
#define EFUSE_VDD_SPI_DREFL_M  (EFUSE_VDD_SPI_DREFL_V << EFUSE_VDD_SPI_DREFL_S)
#define EFUSE_VDD_SPI_DREFL_V  0x00000003
#define EFUSE_VDD_SPI_DREFL_S  2

/* EFUSE_VDD_SPI_DREFM : RO; bitpos: [1:0]; default: 0;
 * SPI regulator medium voltage reference.
 */

#define EFUSE_VDD_SPI_DREFM    0x00000003
#define EFUSE_VDD_SPI_DREFM_M  (EFUSE_VDD_SPI_DREFM_V << EFUSE_VDD_SPI_DREFM_S)
#define EFUSE_VDD_SPI_DREFM_V  0x00000003
#define EFUSE_VDD_SPI_DREFM_S  0

/* EFUSE_RD_REPEAT_DATA2_REG register
 * Register 3 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_DATA2_REG (DR_REG_EFUSE_BASE + 0x38)

/* EFUSE_FLASH_TPUW : RO; bitpos: [31:28]; default: 0;
 * Configures flash startup delay after SoC power-up, in unit of (ms/2).
 * When the value is 15, delay is 7.5 ms.
 */

#define EFUSE_FLASH_TPUW    0x0000000F
#define EFUSE_FLASH_TPUW_M  (EFUSE_FLASH_TPUW_V << EFUSE_FLASH_TPUW_S)
#define EFUSE_FLASH_TPUW_V  0x0000000F
#define EFUSE_FLASH_TPUW_S  28

/* EFUSE_RPT4_RESERVED1 : RO; bitpos: [27:22]; default: 0;
 * Reserved (used for four backups method).
 */

#define EFUSE_RPT4_RESERVED1    0x0000003F
#define EFUSE_RPT4_RESERVED1_M  (EFUSE_RPT4_RESERVED1_V << EFUSE_RPT4_RESERVED1_S)
#define EFUSE_RPT4_RESERVED1_V  0x0000003F
#define EFUSE_RPT4_RESERVED1_S  22

/* EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE : RO; bitpos: [21]; default: 0;
 * Set this bit to enable aggressive secure boot key revocation mode.
 */

#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE    (BIT(21))
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_M  (EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V << EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S)
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V  0x00000001
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S  21

/* EFUSE_SECURE_BOOT_EN : RO; bitpos: [20]; default: 0;
 * Set this bit to enable secure boot.
 */

#define EFUSE_SECURE_BOOT_EN    (BIT(20))
#define EFUSE_SECURE_BOOT_EN_M  (EFUSE_SECURE_BOOT_EN_V << EFUSE_SECURE_BOOT_EN_S)
#define EFUSE_SECURE_BOOT_EN_V  0x00000001
#define EFUSE_SECURE_BOOT_EN_S  20

/* EFUSE_KEY_PURPOSE_6 : RO; bitpos: [19:16]; default: 0;
 * Purpose of KEY6. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_6    0x0000000F
#define EFUSE_KEY_PURPOSE_6_M  (EFUSE_KEY_PURPOSE_6_V << EFUSE_KEY_PURPOSE_6_S)
#define EFUSE_KEY_PURPOSE_6_V  0x0000000F
#define EFUSE_KEY_PURPOSE_6_S  16

/* EFUSE_KEY_PURPOSE_5 : RO; bitpos: [15:12]; default: 0;
 * Purpose of KEY5. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_5    0x0000000F
#define EFUSE_KEY_PURPOSE_5_M  (EFUSE_KEY_PURPOSE_5_V << EFUSE_KEY_PURPOSE_5_S)
#define EFUSE_KEY_PURPOSE_5_V  0x0000000F
#define EFUSE_KEY_PURPOSE_5_S  12

/* EFUSE_KEY_PURPOSE_4 : RO; bitpos: [11:8]; default: 0;
 * Purpose of KEY4. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_4    0x0000000F
#define EFUSE_KEY_PURPOSE_4_M  (EFUSE_KEY_PURPOSE_4_V << EFUSE_KEY_PURPOSE_4_S)
#define EFUSE_KEY_PURPOSE_4_V  0x0000000F
#define EFUSE_KEY_PURPOSE_4_S  8

/* EFUSE_KEY_PURPOSE_3 : RO; bitpos: [7:4]; default: 0;
 * Purpose of KEY3. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_3    0x0000000F
#define EFUSE_KEY_PURPOSE_3_M  (EFUSE_KEY_PURPOSE_3_V << EFUSE_KEY_PURPOSE_3_S)
#define EFUSE_KEY_PURPOSE_3_V  0x0000000F
#define EFUSE_KEY_PURPOSE_3_S  4

/* EFUSE_KEY_PURPOSE_2 : RO; bitpos: [3:0]; default: 0;
 * Purpose of KEY2. Refer to Table Key Purpose Values.
 */

#define EFUSE_KEY_PURPOSE_2    0x0000000F
#define EFUSE_KEY_PURPOSE_2_M  (EFUSE_KEY_PURPOSE_2_V << EFUSE_KEY_PURPOSE_2_S)
#define EFUSE_KEY_PURPOSE_2_V  0x0000000F
#define EFUSE_KEY_PURPOSE_2_S  0

/* EFUSE_RD_REPEAT_DATA3_REG register
 * Register 4 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_DATA3_REG (DR_REG_EFUSE_BASE + 0x3c)

/* EFUSE_RPT4_RESERVED2 : RO; bitpos: [31:27]; default: 0;
 * Reserved (used for four backups method).
 */

#define EFUSE_RPT4_RESERVED2    0x0000001F
#define EFUSE_RPT4_RESERVED2_M  (EFUSE_RPT4_RESERVED2_V << EFUSE_RPT4_RESERVED2_S)
#define EFUSE_RPT4_RESERVED2_V  0x0000001F
#define EFUSE_RPT4_RESERVED2_S  27

/* EFUSE_SECURE_VERSION : RO; bitpos: [26:11]; default: 0;
 * Secure version (used by ESP-IDF anti-rollback feature).
 */

#define EFUSE_SECURE_VERSION    0x0000FFFF
#define EFUSE_SECURE_VERSION_M  (EFUSE_SECURE_VERSION_V << EFUSE_SECURE_VERSION_S)
#define EFUSE_SECURE_VERSION_V  0x0000FFFF
#define EFUSE_SECURE_VERSION_S  11

/* EFUSE_FORCE_SEND_RESUME : RO; bitpos: [10]; default: 0;
 * If set, forces ROM code to send an SPI flash resume command during SPI
 * boot.
 */

#define EFUSE_FORCE_SEND_RESUME    (BIT(10))
#define EFUSE_FORCE_SEND_RESUME_M  (EFUSE_FORCE_SEND_RESUME_V << EFUSE_FORCE_SEND_RESUME_S)
#define EFUSE_FORCE_SEND_RESUME_V  0x00000001
#define EFUSE_FORCE_SEND_RESUME_S  10

/* EFUSE_FLASH_TYPE : RO; bitpos: [9]; default: 0;
 * SPI flash type. 0: maximum four data lines, 1: eight data lines.
 */

#define EFUSE_FLASH_TYPE    (BIT(9))
#define EFUSE_FLASH_TYPE_M  (EFUSE_FLASH_TYPE_V << EFUSE_FLASH_TYPE_S)
#define EFUSE_FLASH_TYPE_V  0x00000001
#define EFUSE_FLASH_TYPE_S  9

/* EFUSE_PIN_POWER_SELECTION : RO; bitpos: [8]; default: 0;
 * Set default power supply for GPIO33-GPIO37, set when SPI flash is
 * initialized. 0: VDD3P3_CPU; 1: VDD_SPI.
 */

#define EFUSE_PIN_POWER_SELECTION    (BIT(8))
#define EFUSE_PIN_POWER_SELECTION_M  (EFUSE_PIN_POWER_SELECTION_V << EFUSE_PIN_POWER_SELECTION_S)
#define EFUSE_PIN_POWER_SELECTION_V  0x00000001
#define EFUSE_PIN_POWER_SELECTION_S  8

/* EFUSE_UART_PRINT_CONTROL : RO; bitpos: [7:6]; default: 0;
 * Set the default UART boot message output mode.
 * &
 * 00: Enabled.#
 * 01: Enable when GPIO46 is low at reset.#
 * 10: Enable when GPIO46 is high at reset.#
 * 11: Disabled.
 * &
 */

