apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_UART_PRINT_CONTROL    0x00000003
#define EFUSE_UART_PRINT_CONTROL_M  (EFUSE_UART_PRINT_CONTROL_V << EFUSE_UART_PRINT_CONTROL_S)
#define EFUSE_UART_PRINT_CONTROL_V  0x00000003
#define EFUSE_UART_PRINT_CONTROL_S  6

/* EFUSE_ENABLE_SECURITY_DOWNLOAD : RO; bitpos: [5]; default: 0;
 * Set this bit to enable secure UART download mode (read/write flash only).
 */

#define EFUSE_ENABLE_SECURITY_DOWNLOAD    (BIT(5))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_V  0x00000001
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_S  5

/* EFUSE_DIS_USB_DOWNLOAD_MODE : RO; bitpos: [4]; default: 0;
 * Set this bit to disable use of USB in UART download boot mode.
 */

#define EFUSE_DIS_USB_DOWNLOAD_MODE    (BIT(4))
#define EFUSE_DIS_USB_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_DOWNLOAD_MODE_V << EFUSE_DIS_USB_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_DOWNLOAD_MODE_V  0x00000001
#define EFUSE_DIS_USB_DOWNLOAD_MODE_S  4

/* EFUSE_RPT4_RESERVED3 : RO; bitpos: [3]; default: 0;
 * Reserved (used for four backups method).
 */

#define EFUSE_RPT4_RESERVED3    (BIT(3))
#define EFUSE_RPT4_RESERVED3_M  (EFUSE_RPT4_RESERVED3_V << EFUSE_RPT4_RESERVED3_S)
#define EFUSE_RPT4_RESERVED3_V  0x00000001
#define EFUSE_RPT4_RESERVED3_S  3

/* EFUSE_UART_PRINT_CHANNEL : RO; bitpos: [2]; default: 0;
 * Selects the default UART for printing boot messages. 0: UART0; 1: UART1.
 */

#define EFUSE_UART_PRINT_CHANNEL    (BIT(2))
#define EFUSE_UART_PRINT_CHANNEL_M  (EFUSE_UART_PRINT_CHANNEL_V << EFUSE_UART_PRINT_CHANNEL_S)
#define EFUSE_UART_PRINT_CHANNEL_V  0x00000001
#define EFUSE_UART_PRINT_CHANNEL_S  2

/* EFUSE_DIS_LEGACY_SPI_BOOT : RO; bitpos: [1]; default: 0;
 * Set this bit to disable Legacy SPI boot mode.
 */

#define EFUSE_DIS_LEGACY_SPI_BOOT    (BIT(1))
#define EFUSE_DIS_LEGACY_SPI_BOOT_M  (EFUSE_DIS_LEGACY_SPI_BOOT_V << EFUSE_DIS_LEGACY_SPI_BOOT_S)
#define EFUSE_DIS_LEGACY_SPI_BOOT_V  0x00000001
#define EFUSE_DIS_LEGACY_SPI_BOOT_S  1

/* EFUSE_DIS_DOWNLOAD_MODE : RO; bitpos: [0]; default: 0;
 * Set this bit to disable all download boot modes.
 */

#define EFUSE_DIS_DOWNLOAD_MODE    (BIT(0))
#define EFUSE_DIS_DOWNLOAD_MODE_M  (EFUSE_DIS_DOWNLOAD_MODE_V << EFUSE_DIS_DOWNLOAD_MODE_S)
#define EFUSE_DIS_DOWNLOAD_MODE_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_MODE_S  0

/* EFUSE_RD_REPEAT_DATA4_REG register
 * Register 5 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_DATA4_REG (DR_REG_EFUSE_BASE + 0x40)

/* EFUSE_RPT4_RESERVED4 : RO; bitpos: [23:0]; default: 0;
 * Reserved (used for four backups method).
 */

#define EFUSE_RPT4_RESERVED4    0x00FFFFFF
#define EFUSE_RPT4_RESERVED4_M  (EFUSE_RPT4_RESERVED4_V << EFUSE_RPT4_RESERVED4_S)
#define EFUSE_RPT4_RESERVED4_V  0x00FFFFFF
#define EFUSE_RPT4_RESERVED4_S  0

/* EFUSE_RD_MAC_SPI_SYS_0_REG register
 * Register 0 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_0_REG (DR_REG_EFUSE_BASE + 0x44)

/* EFUSE_MAC_0 : RO; bitpos: [31:0]; default: 0;
 * Stores the low 32 bits of MAC address.
 */

#define EFUSE_MAC_0    0xFFFFFFFF
#define EFUSE_MAC_0_M  (EFUSE_MAC_0_V << EFUSE_MAC_0_S)
#define EFUSE_MAC_0_V  0xFFFFFFFF
#define EFUSE_MAC_0_S  0

/* EFUSE_RD_MAC_SPI_SYS_1_REG register
 * Register 1 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_1_REG (DR_REG_EFUSE_BASE + 0x48)

/* EFUSE_SPI_PAD_CONF_0 : RO; bitpos: [31:16]; default: 0;
 * Stores the zeroth part of SPI_PAD_CONF.
 */

#define EFUSE_SPI_PAD_CONF_0    0x0000FFFF
#define EFUSE_SPI_PAD_CONF_0_M  (EFUSE_SPI_PAD_CONF_0_V << EFUSE_SPI_PAD_CONF_0_S)
#define EFUSE_SPI_PAD_CONF_0_V  0x0000FFFF
#define EFUSE_SPI_PAD_CONF_0_S  16

/* EFUSE_MAC_1 : RO; bitpos: [15:0]; default: 0;
 * Stores the high 16 bits of MAC address.
 */

#define EFUSE_MAC_1    0x0000FFFF
#define EFUSE_MAC_1_M  (EFUSE_MAC_1_V << EFUSE_MAC_1_S)
#define EFUSE_MAC_1_V  0x0000FFFF
#define EFUSE_MAC_1_S  0

/* EFUSE_RD_MAC_SPI_SYS_2_REG register
 * Register 2 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_2_REG (DR_REG_EFUSE_BASE + 0x4c)

/* EFUSE_SPI_PAD_CONF_1 : RO; bitpos: [31:0]; default: 0;
 * Stores the first part of SPI_PAD_CONF.
 */

#define EFUSE_SPI_PAD_CONF_1    0xFFFFFFFF
#define EFUSE_SPI_PAD_CONF_1_M  (EFUSE_SPI_PAD_CONF_1_V << EFUSE_SPI_PAD_CONF_1_S)
#define EFUSE_SPI_PAD_CONF_1_V  0xFFFFFFFF
#define EFUSE_SPI_PAD_CONF_1_S  0

/* EFUSE_RD_MAC_SPI_SYS_3_REG register
 * Register 3 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_3_REG (DR_REG_EFUSE_BASE + 0x50)

/* EFUSE_SYS_DATA_PART0_0 : RO; bitpos: [31:18]; default: 0;
 * Stores the zeroth part  of the zeroth part of system data.
 */

#define EFUSE_SYS_DATA_PART0_0    0x00003FFF
#define EFUSE_SYS_DATA_PART0_0_M  (EFUSE_SYS_DATA_PART0_0_V << EFUSE_SYS_DATA_PART0_0_S)
#define EFUSE_SYS_DATA_PART0_0_V  0x00003FFF
#define EFUSE_SYS_DATA_PART0_0_S  18

/* EFUSE_SPI_PAD_CONF_2 : RO; bitpos: [17:0]; default: 0;
 * Stores the second part of SPI_PAD_CONF.
 */

#define EFUSE_SPI_PAD_CONF_2    0x0003FFFF
#define EFUSE_SPI_PAD_CONF_2_M  (EFUSE_SPI_PAD_CONF_2_V << EFUSE_SPI_PAD_CONF_2_S)
#define EFUSE_SPI_PAD_CONF_2_V  0x0003FFFF
#define EFUSE_SPI_PAD_CONF_2_S  0

/* EFUSE_RD_MAC_SPI_SYS_4_REG register
 * Register 4 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_4_REG (DR_REG_EFUSE_BASE + 0x54)

/* EFUSE_SYS_DATA_PART0_1 : RO; bitpos: [31:0]; default: 0;
 * Stores the fist part of the zeroth part of system data.
 */

#define EFUSE_SYS_DATA_PART0_1    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART0_1_M  (EFUSE_SYS_DATA_PART0_1_V << EFUSE_SYS_DATA_PART0_1_S)
#define EFUSE_SYS_DATA_PART0_1_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART0_1_S  0

/* EFUSE_RD_MAC_SPI_SYS_5_REG register
 * Register 5 of BLOCK1.
 */

#define EFUSE_RD_MAC_SPI_SYS_5_REG (DR_REG_EFUSE_BASE + 0x58)

/* EFUSE_SYS_DATA_PART0_2 : RO; bitpos: [31:0]; default: 0;
 * Stores the second part of the zeroth part of system data.
 */

#define EFUSE_SYS_DATA_PART0_2    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART0_2_M  (EFUSE_SYS_DATA_PART0_2_V << EFUSE_SYS_DATA_PART0_2_S)
#define EFUSE_SYS_DATA_PART0_2_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART0_2_S  0

/* EFUSE_RD_SYS_DATA_PART1_0_REG register
 * Register 0 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_0_REG (DR_REG_EFUSE_BASE + 0x5c)

/* EFUSE_SYS_DATA_PART1_0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_0    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_0_M  (EFUSE_SYS_DATA_PART1_0_V << EFUSE_SYS_DATA_PART1_0_S)
#define EFUSE_SYS_DATA_PART1_0_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_0_S  0

/* EFUSE_RD_SYS_DATA_PART1_1_REG register
 * Register 1 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_1_REG (DR_REG_EFUSE_BASE + 0x60)

/* EFUSE_SYS_DATA_PART1_1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_1    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_1_M  (EFUSE_SYS_DATA_PART1_1_V << EFUSE_SYS_DATA_PART1_1_S)
#define EFUSE_SYS_DATA_PART1_1_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_1_S  0

