apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_RD_SYS_DATA_PART1_2_REG register
 * Register 2 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_2_REG (DR_REG_EFUSE_BASE + 0x64)

/* EFUSE_SYS_DATA_PART1_2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_2    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_2_M  (EFUSE_SYS_DATA_PART1_2_V << EFUSE_SYS_DATA_PART1_2_S)
#define EFUSE_SYS_DATA_PART1_2_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_2_S  0

/* EFUSE_RD_SYS_DATA_PART1_3_REG register
 * Register 3 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_3_REG (DR_REG_EFUSE_BASE + 0x68)

/* EFUSE_SYS_DATA_PART1_3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_3    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_3_M  (EFUSE_SYS_DATA_PART1_3_V << EFUSE_SYS_DATA_PART1_3_S)
#define EFUSE_SYS_DATA_PART1_3_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_3_S  0

/* EFUSE_RD_SYS_DATA_PART1_4_REG register
 * Register 4 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_4_REG (DR_REG_EFUSE_BASE + 0x6c)

/* EFUSE_SYS_DATA_PART1_4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_4    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_4_M  (EFUSE_SYS_DATA_PART1_4_V << EFUSE_SYS_DATA_PART1_4_S)
#define EFUSE_SYS_DATA_PART1_4_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_4_S  0

/* EFUSE_RD_SYS_DATA_PART1_5_REG register
 * Register 5 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_5_REG (DR_REG_EFUSE_BASE + 0x70)

/* EFUSE_SYS_DATA_PART1_5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_5    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_5_M  (EFUSE_SYS_DATA_PART1_5_V << EFUSE_SYS_DATA_PART1_5_S)
#define EFUSE_SYS_DATA_PART1_5_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_5_S  0

/* EFUSE_RD_SYS_DATA_PART1_6_REG register
 * Register 6 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_6_REG (DR_REG_EFUSE_BASE + 0x74)

/* EFUSE_SYS_DATA_PART1_6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_6    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_6_M  (EFUSE_SYS_DATA_PART1_6_V << EFUSE_SYS_DATA_PART1_6_S)
#define EFUSE_SYS_DATA_PART1_6_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_6_S  0

/* EFUSE_RD_SYS_DATA_PART1_7_REG register
 * Register 7 of BLOCK2 (system).
 */

#define EFUSE_RD_SYS_DATA_PART1_7_REG (DR_REG_EFUSE_BASE + 0x78)

/* EFUSE_SYS_DATA_PART1_7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of the first part of system data.
 */

#define EFUSE_SYS_DATA_PART1_7    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_7_M  (EFUSE_SYS_DATA_PART1_7_V << EFUSE_SYS_DATA_PART1_7_S)
#define EFUSE_SYS_DATA_PART1_7_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART1_7_S  0

/* EFUSE_RD_USR_DATA0_REG register
 * Register 0 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA0_REG (DR_REG_EFUSE_BASE + 0x7c)

/* EFUSE_USR_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA0    0xFFFFFFFF
#define EFUSE_USR_DATA0_M  (EFUSE_USR_DATA0_V << EFUSE_USR_DATA0_S)
#define EFUSE_USR_DATA0_V  0xFFFFFFFF
#define EFUSE_USR_DATA0_S  0

/* EFUSE_RD_USR_DATA1_REG register
 * Register 1 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA1_REG (DR_REG_EFUSE_BASE + 0x80)

/* EFUSE_USR_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA1    0xFFFFFFFF
#define EFUSE_USR_DATA1_M  (EFUSE_USR_DATA1_V << EFUSE_USR_DATA1_S)
#define EFUSE_USR_DATA1_V  0xFFFFFFFF
#define EFUSE_USR_DATA1_S  0

/* EFUSE_RD_USR_DATA2_REG register
 * Register 2 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA2_REG (DR_REG_EFUSE_BASE + 0x84)

/* EFUSE_USR_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA2    0xFFFFFFFF
#define EFUSE_USR_DATA2_M  (EFUSE_USR_DATA2_V << EFUSE_USR_DATA2_S)
#define EFUSE_USR_DATA2_V  0xFFFFFFFF
#define EFUSE_USR_DATA2_S  0

/* EFUSE_RD_USR_DATA3_REG register
 * Register 3 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA3_REG (DR_REG_EFUSE_BASE + 0x88)

/* EFUSE_USR_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA3    0xFFFFFFFF
#define EFUSE_USR_DATA3_M  (EFUSE_USR_DATA3_V << EFUSE_USR_DATA3_S)
#define EFUSE_USR_DATA3_V  0xFFFFFFFF
#define EFUSE_USR_DATA3_S  0

/* EFUSE_RD_USR_DATA4_REG register
 * Register 4 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA4_REG (DR_REG_EFUSE_BASE + 0x8c)

/* EFUSE_USR_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA4    0xFFFFFFFF
#define EFUSE_USR_DATA4_M  (EFUSE_USR_DATA4_V << EFUSE_USR_DATA4_S)
#define EFUSE_USR_DATA4_V  0xFFFFFFFF
#define EFUSE_USR_DATA4_S  0

/* EFUSE_RD_USR_DATA5_REG register
 * Register 5 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA5_REG (DR_REG_EFUSE_BASE + 0x90)

/* EFUSE_USR_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA5    0xFFFFFFFF
#define EFUSE_USR_DATA5_M  (EFUSE_USR_DATA5_V << EFUSE_USR_DATA5_S)
#define EFUSE_USR_DATA5_V  0xFFFFFFFF
#define EFUSE_USR_DATA5_S  0

/* EFUSE_RD_USR_DATA6_REG register
 * Register 6 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA6_REG (DR_REG_EFUSE_BASE + 0x94)

/* EFUSE_USR_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of BLOCK3 (user).
 */

#define EFUSE_USR_DATA6    0xFFFFFFFF
#define EFUSE_USR_DATA6_M  (EFUSE_USR_DATA6_V << EFUSE_USR_DATA6_S)
#define EFUSE_USR_DATA6_V  0xFFFFFFFF
#define EFUSE_USR_DATA6_S  0

/* EFUSE_RD_USR_DATA7_REG register
 * Register 7 of BLOCK3 (user).
 */

#define EFUSE_RD_USR_DATA7_REG (DR_REG_EFUSE_BASE + 0x98)

/* EFUSE_USR_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of BLOCK3 (user).
 */

