apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_USR_DATA7    0xFFFFFFFF
#define EFUSE_USR_DATA7_M  (EFUSE_USR_DATA7_V << EFUSE_USR_DATA7_S)
#define EFUSE_USR_DATA7_V  0xFFFFFFFF
#define EFUSE_USR_DATA7_S  0

/* EFUSE_RD_KEY0_DATA0_REG register
 * Register 0 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA0_REG (DR_REG_EFUSE_BASE + 0x9c)

/* EFUSE_KEY0_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA0    0xFFFFFFFF
#define EFUSE_KEY0_DATA0_M  (EFUSE_KEY0_DATA0_V << EFUSE_KEY0_DATA0_S)
#define EFUSE_KEY0_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA0_S  0

/* EFUSE_RD_KEY0_DATA1_REG register
 * Register 1 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA1_REG (DR_REG_EFUSE_BASE + 0xa0)

/* EFUSE_KEY0_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA1    0xFFFFFFFF
#define EFUSE_KEY0_DATA1_M  (EFUSE_KEY0_DATA1_V << EFUSE_KEY0_DATA1_S)
#define EFUSE_KEY0_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA1_S  0

/* EFUSE_RD_KEY0_DATA2_REG register
 * Register 2 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA2_REG (DR_REG_EFUSE_BASE + 0xa4)

/* EFUSE_KEY0_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA2    0xFFFFFFFF
#define EFUSE_KEY0_DATA2_M  (EFUSE_KEY0_DATA2_V << EFUSE_KEY0_DATA2_S)
#define EFUSE_KEY0_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA2_S  0

/* EFUSE_RD_KEY0_DATA3_REG register
 * Register 3 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA3_REG (DR_REG_EFUSE_BASE + 0xa8)

/* EFUSE_KEY0_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA3    0xFFFFFFFF
#define EFUSE_KEY0_DATA3_M  (EFUSE_KEY0_DATA3_V << EFUSE_KEY0_DATA3_S)
#define EFUSE_KEY0_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA3_S  0

/* EFUSE_RD_KEY0_DATA4_REG register
 * Register 4 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA4_REG (DR_REG_EFUSE_BASE + 0xac)

/* EFUSE_KEY0_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA4    0xFFFFFFFF
#define EFUSE_KEY0_DATA4_M  (EFUSE_KEY0_DATA4_V << EFUSE_KEY0_DATA4_S)
#define EFUSE_KEY0_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA4_S  0

/* EFUSE_RD_KEY0_DATA5_REG register
 * Register 5 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA5_REG (DR_REG_EFUSE_BASE + 0xb0)

/* EFUSE_KEY0_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA5    0xFFFFFFFF
#define EFUSE_KEY0_DATA5_M  (EFUSE_KEY0_DATA5_V << EFUSE_KEY0_DATA5_S)
#define EFUSE_KEY0_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA5_S  0

/* EFUSE_RD_KEY0_DATA6_REG register
 * Register 6 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA6_REG (DR_REG_EFUSE_BASE + 0xb4)

/* EFUSE_KEY0_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA6    0xFFFFFFFF
#define EFUSE_KEY0_DATA6_M  (EFUSE_KEY0_DATA6_V << EFUSE_KEY0_DATA6_S)
#define EFUSE_KEY0_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA6_S  0

/* EFUSE_RD_KEY0_DATA7_REG register
 * Register 7 of BLOCK4 (KEY0).
 */

#define EFUSE_RD_KEY0_DATA7_REG (DR_REG_EFUSE_BASE + 0xb8)

/* EFUSE_KEY0_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY0.
 */

#define EFUSE_KEY0_DATA7    0xFFFFFFFF
#define EFUSE_KEY0_DATA7_M  (EFUSE_KEY0_DATA7_V << EFUSE_KEY0_DATA7_S)
#define EFUSE_KEY0_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY0_DATA7_S  0

/* EFUSE_RD_KEY1_DATA0_REG register
 * Register 0 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA0_REG (DR_REG_EFUSE_BASE + 0xbc)

/* EFUSE_KEY1_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA0    0xFFFFFFFF
#define EFUSE_KEY1_DATA0_M  (EFUSE_KEY1_DATA0_V << EFUSE_KEY1_DATA0_S)
#define EFUSE_KEY1_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA0_S  0

/* EFUSE_RD_KEY1_DATA1_REG register
 * Register 1 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA1_REG (DR_REG_EFUSE_BASE + 0xc0)

/* EFUSE_KEY1_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA1    0xFFFFFFFF
#define EFUSE_KEY1_DATA1_M  (EFUSE_KEY1_DATA1_V << EFUSE_KEY1_DATA1_S)
#define EFUSE_KEY1_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA1_S  0

/* EFUSE_RD_KEY1_DATA2_REG register
 * Register 2 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA2_REG (DR_REG_EFUSE_BASE + 0xc4)

/* EFUSE_KEY1_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA2    0xFFFFFFFF
#define EFUSE_KEY1_DATA2_M  (EFUSE_KEY1_DATA2_V << EFUSE_KEY1_DATA2_S)
#define EFUSE_KEY1_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA2_S  0

/* EFUSE_RD_KEY1_DATA3_REG register
 * Register 3 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA3_REG (DR_REG_EFUSE_BASE + 0xc8)

/* EFUSE_KEY1_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA3    0xFFFFFFFF
#define EFUSE_KEY1_DATA3_M  (EFUSE_KEY1_DATA3_V << EFUSE_KEY1_DATA3_S)
#define EFUSE_KEY1_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA3_S  0

/* EFUSE_RD_KEY1_DATA4_REG register
 * Register 4 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA4_REG (DR_REG_EFUSE_BASE + 0xcc)

/* EFUSE_KEY1_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA4    0xFFFFFFFF
#define EFUSE_KEY1_DATA4_M  (EFUSE_KEY1_DATA4_V << EFUSE_KEY1_DATA4_S)
#define EFUSE_KEY1_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA4_S  0

/* EFUSE_RD_KEY1_DATA5_REG register
 * Register 5 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA5_REG (DR_REG_EFUSE_BASE + 0xd0)

/* EFUSE_KEY1_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA5    0xFFFFFFFF
#define EFUSE_KEY1_DATA5_M  (EFUSE_KEY1_DATA5_V << EFUSE_KEY1_DATA5_S)
#define EFUSE_KEY1_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA5_S  0

/* EFUSE_RD_KEY1_DATA6_REG register
 * Register 6 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA6_REG (DR_REG_EFUSE_BASE + 0xd4)

/* EFUSE_KEY1_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA6    0xFFFFFFFF
#define EFUSE_KEY1_DATA6_M  (EFUSE_KEY1_DATA6_V << EFUSE_KEY1_DATA6_S)
#define EFUSE_KEY1_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA6_S  0

/* EFUSE_RD_KEY1_DATA7_REG register
 * Register 7 of BLOCK5 (KEY1).
 */

#define EFUSE_RD_KEY1_DATA7_REG (DR_REG_EFUSE_BASE + 0xd8)

/* EFUSE_KEY1_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY1.
 */

#define EFUSE_KEY1_DATA7    0xFFFFFFFF
#define EFUSE_KEY1_DATA7_M  (EFUSE_KEY1_DATA7_V << EFUSE_KEY1_DATA7_S)
#define EFUSE_KEY1_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY1_DATA7_S  0

/* EFUSE_RD_KEY2_DATA0_REG register
 * Register 0 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA0_REG (DR_REG_EFUSE_BASE + 0xdc)

/* EFUSE_KEY2_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA0    0xFFFFFFFF
#define EFUSE_KEY2_DATA0_M  (EFUSE_KEY2_DATA0_V << EFUSE_KEY2_DATA0_S)
#define EFUSE_KEY2_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA0_S  0

/* EFUSE_RD_KEY2_DATA1_REG register
 * Register 1 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA1_REG (DR_REG_EFUSE_BASE + 0xe0)

/* EFUSE_KEY2_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA1    0xFFFFFFFF
#define EFUSE_KEY2_DATA1_M  (EFUSE_KEY2_DATA1_V << EFUSE_KEY2_DATA1_S)
#define EFUSE_KEY2_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA1_S  0

/* EFUSE_RD_KEY2_DATA2_REG register
 * Register 2 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA2_REG (DR_REG_EFUSE_BASE + 0xe4)

/* EFUSE_KEY2_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA2    0xFFFFFFFF
#define EFUSE_KEY2_DATA2_M  (EFUSE_KEY2_DATA2_V << EFUSE_KEY2_DATA2_S)
#define EFUSE_KEY2_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA2_S  0

