apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_RD_KEY2_DATA3_REG register
 * Register 3 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA3_REG (DR_REG_EFUSE_BASE + 0xe8)

/* EFUSE_KEY2_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA3    0xFFFFFFFF
#define EFUSE_KEY2_DATA3_M  (EFUSE_KEY2_DATA3_V << EFUSE_KEY2_DATA3_S)
#define EFUSE_KEY2_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA3_S  0

/* EFUSE_RD_KEY2_DATA4_REG register
 * Register 4 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA4_REG (DR_REG_EFUSE_BASE + 0xec)

/* EFUSE_KEY2_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA4    0xFFFFFFFF
#define EFUSE_KEY2_DATA4_M  (EFUSE_KEY2_DATA4_V << EFUSE_KEY2_DATA4_S)
#define EFUSE_KEY2_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA4_S  0

/* EFUSE_RD_KEY2_DATA5_REG register
 * Register 5 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA5_REG (DR_REG_EFUSE_BASE + 0xf0)

/* EFUSE_KEY2_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA5    0xFFFFFFFF
#define EFUSE_KEY2_DATA5_M  (EFUSE_KEY2_DATA5_V << EFUSE_KEY2_DATA5_S)
#define EFUSE_KEY2_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA5_S  0

/* EFUSE_RD_KEY2_DATA6_REG register
 * Register 6 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA6_REG (DR_REG_EFUSE_BASE + 0xf4)

/* EFUSE_KEY2_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA6    0xFFFFFFFF
#define EFUSE_KEY2_DATA6_M  (EFUSE_KEY2_DATA6_V << EFUSE_KEY2_DATA6_S)
#define EFUSE_KEY2_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA6_S  0

/* EFUSE_RD_KEY2_DATA7_REG register
 * Register 7 of BLOCK6 (KEY2).
 */

#define EFUSE_RD_KEY2_DATA7_REG (DR_REG_EFUSE_BASE + 0xf8)

/* EFUSE_KEY2_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY2.
 */

#define EFUSE_KEY2_DATA7    0xFFFFFFFF
#define EFUSE_KEY2_DATA7_M  (EFUSE_KEY2_DATA7_V << EFUSE_KEY2_DATA7_S)
#define EFUSE_KEY2_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY2_DATA7_S  0

/* EFUSE_RD_KEY3_DATA0_REG register
 * Register 0 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA0_REG (DR_REG_EFUSE_BASE + 0xfc)

/* EFUSE_KEY3_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA0    0xFFFFFFFF
#define EFUSE_KEY3_DATA0_M  (EFUSE_KEY3_DATA0_V << EFUSE_KEY3_DATA0_S)
#define EFUSE_KEY3_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA0_S  0

/* EFUSE_RD_KEY3_DATA1_REG register
 * Register 1 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA1_REG (DR_REG_EFUSE_BASE + 0x100)

/* EFUSE_KEY3_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA1    0xFFFFFFFF
#define EFUSE_KEY3_DATA1_M  (EFUSE_KEY3_DATA1_V << EFUSE_KEY3_DATA1_S)
#define EFUSE_KEY3_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA1_S  0

/* EFUSE_RD_KEY3_DATA2_REG register
 * Register 2 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA2_REG (DR_REG_EFUSE_BASE + 0x104)

/* EFUSE_KEY3_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA2    0xFFFFFFFF
#define EFUSE_KEY3_DATA2_M  (EFUSE_KEY3_DATA2_V << EFUSE_KEY3_DATA2_S)
#define EFUSE_KEY3_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA2_S  0

/* EFUSE_RD_KEY3_DATA3_REG register
 * Register 3 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA3_REG (DR_REG_EFUSE_BASE + 0x108)

/* EFUSE_KEY3_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA3    0xFFFFFFFF
#define EFUSE_KEY3_DATA3_M  (EFUSE_KEY3_DATA3_V << EFUSE_KEY3_DATA3_S)
#define EFUSE_KEY3_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA3_S  0

/* EFUSE_RD_KEY3_DATA4_REG register
 * Register 4 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA4_REG (DR_REG_EFUSE_BASE + 0x10c)

/* EFUSE_KEY3_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA4    0xFFFFFFFF
#define EFUSE_KEY3_DATA4_M  (EFUSE_KEY3_DATA4_V << EFUSE_KEY3_DATA4_S)
#define EFUSE_KEY3_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA4_S  0

/* EFUSE_RD_KEY3_DATA5_REG register
 * Register 5 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA5_REG (DR_REG_EFUSE_BASE + 0x110)

/* EFUSE_KEY3_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA5    0xFFFFFFFF
#define EFUSE_KEY3_DATA5_M  (EFUSE_KEY3_DATA5_V << EFUSE_KEY3_DATA5_S)
#define EFUSE_KEY3_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA5_S  0

/* EFUSE_RD_KEY3_DATA6_REG register
 * Register 6 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA6_REG (DR_REG_EFUSE_BASE + 0x114)

/* EFUSE_KEY3_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA6    0xFFFFFFFF
#define EFUSE_KEY3_DATA6_M  (EFUSE_KEY3_DATA6_V << EFUSE_KEY3_DATA6_S)
#define EFUSE_KEY3_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA6_S  0

/* EFUSE_RD_KEY3_DATA7_REG register
 * Register 7 of BLOCK7 (KEY3).
 */

#define EFUSE_RD_KEY3_DATA7_REG (DR_REG_EFUSE_BASE + 0x118)

/* EFUSE_KEY3_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY3.
 */

#define EFUSE_KEY3_DATA7    0xFFFFFFFF
#define EFUSE_KEY3_DATA7_M  (EFUSE_KEY3_DATA7_V << EFUSE_KEY3_DATA7_S)
#define EFUSE_KEY3_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY3_DATA7_S  0

/* EFUSE_RD_KEY4_DATA0_REG register
 * Register 0 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA0_REG (DR_REG_EFUSE_BASE + 0x11c)

/* EFUSE_KEY4_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA0    0xFFFFFFFF
#define EFUSE_KEY4_DATA0_M  (EFUSE_KEY4_DATA0_V << EFUSE_KEY4_DATA0_S)
#define EFUSE_KEY4_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA0_S  0

/* EFUSE_RD_KEY4_DATA1_REG register
 * Register 1 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA1_REG (DR_REG_EFUSE_BASE + 0x120)

/* EFUSE_KEY4_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA1    0xFFFFFFFF
#define EFUSE_KEY4_DATA1_M  (EFUSE_KEY4_DATA1_V << EFUSE_KEY4_DATA1_S)
#define EFUSE_KEY4_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA1_S  0

/* EFUSE_RD_KEY4_DATA2_REG register
 * Register 2 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA2_REG (DR_REG_EFUSE_BASE + 0x124)

/* EFUSE_KEY4_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA2    0xFFFFFFFF
#define EFUSE_KEY4_DATA2_M  (EFUSE_KEY4_DATA2_V << EFUSE_KEY4_DATA2_S)
#define EFUSE_KEY4_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA2_S  0

/* EFUSE_RD_KEY4_DATA3_REG register
 * Register 3 of BLOCK8 (KEY4).
 */

