apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_RD_KEY4_DATA3_REG (DR_REG_EFUSE_BASE + 0x128)

/* EFUSE_KEY4_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA3    0xFFFFFFFF
#define EFUSE_KEY4_DATA3_M  (EFUSE_KEY4_DATA3_V << EFUSE_KEY4_DATA3_S)
#define EFUSE_KEY4_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA3_S  0

/* EFUSE_RD_KEY4_DATA4_REG register
 * Register 4 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA4_REG (DR_REG_EFUSE_BASE + 0x12c)

/* EFUSE_KEY4_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA4    0xFFFFFFFF
#define EFUSE_KEY4_DATA4_M  (EFUSE_KEY4_DATA4_V << EFUSE_KEY4_DATA4_S)
#define EFUSE_KEY4_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA4_S  0

/* EFUSE_RD_KEY4_DATA5_REG register
 * Register 5 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA5_REG (DR_REG_EFUSE_BASE + 0x130)

/* EFUSE_KEY4_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA5    0xFFFFFFFF
#define EFUSE_KEY4_DATA5_M  (EFUSE_KEY4_DATA5_V << EFUSE_KEY4_DATA5_S)
#define EFUSE_KEY4_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA5_S  0

/* EFUSE_RD_KEY4_DATA6_REG register
 * Register 6 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA6_REG (DR_REG_EFUSE_BASE + 0x134)

/* EFUSE_KEY4_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA6    0xFFFFFFFF
#define EFUSE_KEY4_DATA6_M  (EFUSE_KEY4_DATA6_V << EFUSE_KEY4_DATA6_S)
#define EFUSE_KEY4_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA6_S  0

/* EFUSE_RD_KEY4_DATA7_REG register
 * Register 7 of BLOCK8 (KEY4).
 */

#define EFUSE_RD_KEY4_DATA7_REG (DR_REG_EFUSE_BASE + 0x138)

/* EFUSE_KEY4_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY4.
 */

#define EFUSE_KEY4_DATA7    0xFFFFFFFF
#define EFUSE_KEY4_DATA7_M  (EFUSE_KEY4_DATA7_V << EFUSE_KEY4_DATA7_S)
#define EFUSE_KEY4_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY4_DATA7_S  0

/* EFUSE_RD_KEY5_DATA0_REG register
 * Register 0 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA0_REG (DR_REG_EFUSE_BASE + 0x13c)

/* EFUSE_KEY5_DATA0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA0    0xFFFFFFFF
#define EFUSE_KEY5_DATA0_M  (EFUSE_KEY5_DATA0_V << EFUSE_KEY5_DATA0_S)
#define EFUSE_KEY5_DATA0_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA0_S  0

/* EFUSE_RD_KEY5_DATA1_REG register
 * Register 1 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA1_REG (DR_REG_EFUSE_BASE + 0x140)

/* EFUSE_KEY5_DATA1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA1    0xFFFFFFFF
#define EFUSE_KEY5_DATA1_M  (EFUSE_KEY5_DATA1_V << EFUSE_KEY5_DATA1_S)
#define EFUSE_KEY5_DATA1_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA1_S  0

/* EFUSE_RD_KEY5_DATA2_REG register
 * Register 2 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA2_REG (DR_REG_EFUSE_BASE + 0x144)

/* EFUSE_KEY5_DATA2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA2    0xFFFFFFFF
#define EFUSE_KEY5_DATA2_M  (EFUSE_KEY5_DATA2_V << EFUSE_KEY5_DATA2_S)
#define EFUSE_KEY5_DATA2_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA2_S  0

/* EFUSE_RD_KEY5_DATA3_REG register
 * Register 3 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA3_REG (DR_REG_EFUSE_BASE + 0x148)

/* EFUSE_KEY5_DATA3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA3    0xFFFFFFFF
#define EFUSE_KEY5_DATA3_M  (EFUSE_KEY5_DATA3_V << EFUSE_KEY5_DATA3_S)
#define EFUSE_KEY5_DATA3_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA3_S  0

/* EFUSE_RD_KEY5_DATA4_REG register
 * Register 4 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA4_REG (DR_REG_EFUSE_BASE + 0x14c)

/* EFUSE_KEY5_DATA4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA4    0xFFFFFFFF
#define EFUSE_KEY5_DATA4_M  (EFUSE_KEY5_DATA4_V << EFUSE_KEY5_DATA4_S)
#define EFUSE_KEY5_DATA4_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA4_S  0

/* EFUSE_RD_KEY5_DATA5_REG register
 * Register 5 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA5_REG (DR_REG_EFUSE_BASE + 0x150)

/* EFUSE_KEY5_DATA5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA5    0xFFFFFFFF
#define EFUSE_KEY5_DATA5_M  (EFUSE_KEY5_DATA5_V << EFUSE_KEY5_DATA5_S)
#define EFUSE_KEY5_DATA5_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA5_S  0

/* EFUSE_RD_KEY5_DATA6_REG register
 * Register 6 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA6_REG (DR_REG_EFUSE_BASE + 0x154)

/* EFUSE_KEY5_DATA6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA6    0xFFFFFFFF
#define EFUSE_KEY5_DATA6_M  (EFUSE_KEY5_DATA6_V << EFUSE_KEY5_DATA6_S)
#define EFUSE_KEY5_DATA6_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA6_S  0

/* EFUSE_RD_KEY5_DATA7_REG register
 * Register 7 of BLOCK9 (KEY5).
 */

#define EFUSE_RD_KEY5_DATA7_REG (DR_REG_EFUSE_BASE + 0x158)

/* EFUSE_KEY5_DATA7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of KEY5.
 */

#define EFUSE_KEY5_DATA7    0xFFFFFFFF
#define EFUSE_KEY5_DATA7_M  (EFUSE_KEY5_DATA7_V << EFUSE_KEY5_DATA7_S)
#define EFUSE_KEY5_DATA7_V  0xFFFFFFFF
#define EFUSE_KEY5_DATA7_S  0

/* EFUSE_RD_SYS_DATA_PART2_0_REG register
 * Register 0 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_0_REG (DR_REG_EFUSE_BASE + 0x15c)

/* EFUSE_SYS_DATA_PART2_0 : RO; bitpos: [31:0]; default: 0;
 * Stores the 0th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_0    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_0_M  (EFUSE_SYS_DATA_PART2_0_V << EFUSE_SYS_DATA_PART2_0_S)
#define EFUSE_SYS_DATA_PART2_0_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_0_S  0

/* EFUSE_RD_SYS_DATA_PART2_1_REG register
 * Register 1 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_1_REG (DR_REG_EFUSE_BASE + 0x160)

/* EFUSE_SYS_DATA_PART2_1 : RO; bitpos: [31:0]; default: 0;
 * Stores the 1th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_1    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_1_M  (EFUSE_SYS_DATA_PART2_1_V << EFUSE_SYS_DATA_PART2_1_S)
#define EFUSE_SYS_DATA_PART2_1_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_1_S  0

/* EFUSE_RD_SYS_DATA_PART2_2_REG register
 * Register 2 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_2_REG (DR_REG_EFUSE_BASE + 0x164)

/* EFUSE_SYS_DATA_PART2_2 : RO; bitpos: [31:0]; default: 0;
 * Stores the 2th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_2    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_2_M  (EFUSE_SYS_DATA_PART2_2_V << EFUSE_SYS_DATA_PART2_2_S)
#define EFUSE_SYS_DATA_PART2_2_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_2_S  0

