apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_RD_SYS_DATA_PART2_3_REG register
 * Register 3 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_3_REG (DR_REG_EFUSE_BASE + 0x168)

/* EFUSE_SYS_DATA_PART2_3 : RO; bitpos: [31:0]; default: 0;
 * Stores the 3th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_3    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_3_M  (EFUSE_SYS_DATA_PART2_3_V << EFUSE_SYS_DATA_PART2_3_S)
#define EFUSE_SYS_DATA_PART2_3_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_3_S  0

/* EFUSE_RD_SYS_DATA_PART2_4_REG register
 * Register 4 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_4_REG (DR_REG_EFUSE_BASE + 0x16c)

/* EFUSE_SYS_DATA_PART2_4 : RO; bitpos: [31:0]; default: 0;
 * Stores the 4th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_4    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_4_M  (EFUSE_SYS_DATA_PART2_4_V << EFUSE_SYS_DATA_PART2_4_S)
#define EFUSE_SYS_DATA_PART2_4_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_4_S  0

/* EFUSE_RD_SYS_DATA_PART2_5_REG register
 * Register 5 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_5_REG (DR_REG_EFUSE_BASE + 0x170)

/* EFUSE_SYS_DATA_PART2_5 : RO; bitpos: [31:0]; default: 0;
 * Stores the 5th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_5    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_5_M  (EFUSE_SYS_DATA_PART2_5_V << EFUSE_SYS_DATA_PART2_5_S)
#define EFUSE_SYS_DATA_PART2_5_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_5_S  0

/* EFUSE_RD_SYS_DATA_PART2_6_REG register
 * Register 6 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_6_REG (DR_REG_EFUSE_BASE + 0x174)

/* EFUSE_SYS_DATA_PART2_6 : RO; bitpos: [31:0]; default: 0;
 * Stores the 6th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_6    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_6_M  (EFUSE_SYS_DATA_PART2_6_V << EFUSE_SYS_DATA_PART2_6_S)
#define EFUSE_SYS_DATA_PART2_6_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_6_S  0

/* EFUSE_RD_SYS_DATA_PART2_7_REG register
 * Register 7 of BLOCK10 (system).
 */

#define EFUSE_RD_SYS_DATA_PART2_7_REG (DR_REG_EFUSE_BASE + 0x178)

/* EFUSE_SYS_DATA_PART2_7 : RO; bitpos: [31:0]; default: 0;
 * Stores the 7th 32 bits of the 2nd part of system data.
 */

#define EFUSE_SYS_DATA_PART2_7    0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_7_M  (EFUSE_SYS_DATA_PART2_7_V << EFUSE_SYS_DATA_PART2_7_S)
#define EFUSE_SYS_DATA_PART2_7_V  0xFFFFFFFF
#define EFUSE_SYS_DATA_PART2_7_S  0

/* EFUSE_RD_REPEAT_ERR0_REG register
 * Programming error record register 0 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_ERR0_REG (DR_REG_EFUSE_BASE + 0x17c)

/* EFUSE_VDD_SPI_DREFH_ERR : RO; bitpos: [31:30]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_DREFH.
 */

#define EFUSE_VDD_SPI_DREFH_ERR    0x00000003
#define EFUSE_VDD_SPI_DREFH_ERR_M  (EFUSE_VDD_SPI_DREFH_ERR_V << EFUSE_VDD_SPI_DREFH_ERR_S)
#define EFUSE_VDD_SPI_DREFH_ERR_V  0x00000003
#define EFUSE_VDD_SPI_DREFH_ERR_S  30

/* EFUSE_VDD_SPI_MODECURLIM_ERR : RO; bitpos: [29]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_MODECURLIM.
 */

#define EFUSE_VDD_SPI_MODECURLIM_ERR    (BIT(29))
#define EFUSE_VDD_SPI_MODECURLIM_ERR_M  (EFUSE_VDD_SPI_MODECURLIM_ERR_V << EFUSE_VDD_SPI_MODECURLIM_ERR_S)
#define EFUSE_VDD_SPI_MODECURLIM_ERR_V  0x00000001
#define EFUSE_VDD_SPI_MODECURLIM_ERR_S  29

/* EFUSE_RPT4_RESERVED0_ERR : RO; bitpos: [28:27]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RPT4_RESERVED0.
 */

#define EFUSE_RPT4_RESERVED0_ERR    0x00000003
#define EFUSE_RPT4_RESERVED0_ERR_M  (EFUSE_RPT4_RESERVED0_ERR_V << EFUSE_RPT4_RESERVED0_ERR_S)
#define EFUSE_RPT4_RESERVED0_ERR_V  0x00000003
#define EFUSE_RPT4_RESERVED0_ERR_S  27

/* EFUSE_USB_FORCE_NOPERSIST_ERR : RO; bitpos: [26]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_USB_FORCE_NOPERSIST.
 */

#define EFUSE_USB_FORCE_NOPERSIST_ERR    (BIT(26))
#define EFUSE_USB_FORCE_NOPERSIST_ERR_M  (EFUSE_USB_FORCE_NOPERSIST_ERR_V << EFUSE_USB_FORCE_NOPERSIST_ERR_S)
#define EFUSE_USB_FORCE_NOPERSIST_ERR_V  0x00000001
#define EFUSE_USB_FORCE_NOPERSIST_ERR_S  26

/* EFUSE_EXT_PHY_ENABLE_ERR : RO; bitpos: [25]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_EXT_PHY_ENABLE.
 */

#define EFUSE_EXT_PHY_ENABLE_ERR    (BIT(25))
#define EFUSE_EXT_PHY_ENABLE_ERR_M  (EFUSE_EXT_PHY_ENABLE_ERR_V << EFUSE_EXT_PHY_ENABLE_ERR_S)
#define EFUSE_EXT_PHY_ENABLE_ERR_V  0x00000001
#define EFUSE_EXT_PHY_ENABLE_ERR_S  25

/* EFUSE_USB_EXCHG_PINS_ERR : RO; bitpos: [24]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_USB_EXCHG_PINS.
 */

#define EFUSE_USB_EXCHG_PINS_ERR    (BIT(24))
#define EFUSE_USB_EXCHG_PINS_ERR_M  (EFUSE_USB_EXCHG_PINS_ERR_V << EFUSE_USB_EXCHG_PINS_ERR_S)
#define EFUSE_USB_EXCHG_PINS_ERR_V  0x00000001
#define EFUSE_USB_EXCHG_PINS_ERR_S  24

/* EFUSE_USB_DREFL_ERR : RO; bitpos: [23:22]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_USB_DREFL.
 */

#define EFUSE_USB_DREFL_ERR    0x00000003
#define EFUSE_USB_DREFL_ERR_M  (EFUSE_USB_DREFL_ERR_V << EFUSE_USB_DREFL_ERR_S)
#define EFUSE_USB_DREFL_ERR_V  0x00000003
#define EFUSE_USB_DREFL_ERR_S  22

/* EFUSE_USB_DREFH_ERR : RO; bitpos: [21:20]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_USB_DREFH.
 */

#define EFUSE_USB_DREFH_ERR    0x00000003
#define EFUSE_USB_DREFH_ERR_M  (EFUSE_USB_DREFH_ERR_V << EFUSE_USB_DREFH_ERR_S)
#define EFUSE_USB_DREFH_ERR_V  0x00000003
#define EFUSE_USB_DREFH_ERR_S  20

/* EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR : RO; bitpos: [19]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT.
 */

#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR    (BIT(19))
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_M  (EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V << EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S)
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR_S  19

/* EFUSE_HARD_DIS_JTAG_ERR : RO; bitpos: [18]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_HARD_DIS_JTAG.
 */

#define EFUSE_HARD_DIS_JTAG_ERR    (BIT(18))
#define EFUSE_HARD_DIS_JTAG_ERR_M  (EFUSE_HARD_DIS_JTAG_ERR_V << EFUSE_HARD_DIS_JTAG_ERR_S)
#define EFUSE_HARD_DIS_JTAG_ERR_V  0x00000001
#define EFUSE_HARD_DIS_JTAG_ERR_S  18

/* EFUSE_SOFT_DIS_JTAG_ERR : RO; bitpos: [17]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SOFT_DIS_JTAG.
 */

#define EFUSE_SOFT_DIS_JTAG_ERR    (BIT(17))
#define EFUSE_SOFT_DIS_JTAG_ERR_M  (EFUSE_SOFT_DIS_JTAG_ERR_V << EFUSE_SOFT_DIS_JTAG_ERR_S)
#define EFUSE_SOFT_DIS_JTAG_ERR_V  0x00000001
#define EFUSE_SOFT_DIS_JTAG_ERR_S  17

/* EFUSE_DIS_EFUSE_ATE_WR_ERR : RO; bitpos: [16]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_EFUSE_ATE_WR.
 */

#define EFUSE_DIS_EFUSE_ATE_WR_ERR    (BIT(16))
#define EFUSE_DIS_EFUSE_ATE_WR_ERR_M  (EFUSE_DIS_EFUSE_ATE_WR_ERR_V << EFUSE_DIS_EFUSE_ATE_WR_ERR_S)
#define EFUSE_DIS_EFUSE_ATE_WR_ERR_V  0x00000001
#define EFUSE_DIS_EFUSE_ATE_WR_ERR_S  16

/* EFUSE_DIS_BOOT_REMAP_ERR : RO; bitpos: [15]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_BOOT_REMAP.
 */

#define EFUSE_DIS_BOOT_REMAP_ERR    (BIT(15))
#define EFUSE_DIS_BOOT_REMAP_ERR_M  (EFUSE_DIS_BOOT_REMAP_ERR_V << EFUSE_DIS_BOOT_REMAP_ERR_S)
#define EFUSE_DIS_BOOT_REMAP_ERR_V  0x00000001
#define EFUSE_DIS_BOOT_REMAP_ERR_S  15

/* EFUSE_DIS_CAN_ERR : RO; bitpos: [14]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_CAN.
 */

