apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_DIS_CAN_ERR    (BIT(14))
#define EFUSE_DIS_CAN_ERR_M  (EFUSE_DIS_CAN_ERR_V << EFUSE_DIS_CAN_ERR_S)
#define EFUSE_DIS_CAN_ERR_V  0x00000001
#define EFUSE_DIS_CAN_ERR_S  14

/* EFUSE_DIS_USB_ERR : RO; bitpos: [13]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_USB.
 */

#define EFUSE_DIS_USB_ERR    (BIT(13))
#define EFUSE_DIS_USB_ERR_M  (EFUSE_DIS_USB_ERR_V << EFUSE_DIS_USB_ERR_S)
#define EFUSE_DIS_USB_ERR_V  0x00000001
#define EFUSE_DIS_USB_ERR_S  13

/* EFUSE_DIS_FORCE_DOWNLOAD_ERR : RO; bitpos: [12]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_FORCE_DOWNLOAD.
 */

#define EFUSE_DIS_FORCE_DOWNLOAD_ERR    (BIT(12))
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_M  (EFUSE_DIS_FORCE_DOWNLOAD_ERR_V << EFUSE_DIS_FORCE_DOWNLOAD_ERR_S)
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_V  0x00000001
#define EFUSE_DIS_FORCE_DOWNLOAD_ERR_S  12

/* EFUSE_DIS_DOWNLOAD_DCACHE_ERR : RO; bitpos: [11]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_DOWNLOAD_DCACHE.
 */

#define EFUSE_DIS_DOWNLOAD_DCACHE_ERR    (BIT(11))
#define EFUSE_DIS_DOWNLOAD_DCACHE_ERR_M  (EFUSE_DIS_DOWNLOAD_DCACHE_ERR_V << EFUSE_DIS_DOWNLOAD_DCACHE_ERR_S)
#define EFUSE_DIS_DOWNLOAD_DCACHE_ERR_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_DCACHE_ERR_S  11

/* EFUSE_DIS_DOWNLOAD_ICACHE_ERR : RO; bitpos: [10]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_DOWNLOAD_ICACHE.
 */

#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR    (BIT(10))
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_M  (EFUSE_DIS_DOWNLOAD_ICACHE_ERR_V << EFUSE_DIS_DOWNLOAD_ICACHE_ERR_S)
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_ICACHE_ERR_S  10

/* EFUSE_DIS_DCACHE_ERR : RO; bitpos: [9]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_DCACHE.
 */

#define EFUSE_DIS_DCACHE_ERR    (BIT(9))
#define EFUSE_DIS_DCACHE_ERR_M  (EFUSE_DIS_DCACHE_ERR_V << EFUSE_DIS_DCACHE_ERR_S)
#define EFUSE_DIS_DCACHE_ERR_V  0x00000001
#define EFUSE_DIS_DCACHE_ERR_S  9

/* EFUSE_DIS_ICACHE_ERR : RO; bitpos: [8]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_ICACHE.
 */

#define EFUSE_DIS_ICACHE_ERR    (BIT(8))
#define EFUSE_DIS_ICACHE_ERR_M  (EFUSE_DIS_ICACHE_ERR_V << EFUSE_DIS_ICACHE_ERR_S)
#define EFUSE_DIS_ICACHE_ERR_V  0x00000001
#define EFUSE_DIS_ICACHE_ERR_S  8

/* EFUSE_DIS_RTC_RAM_BOOT_ERR : RO; bitpos: [7]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_RTC_RAM_BOOT.
 */

#define EFUSE_DIS_RTC_RAM_BOOT_ERR    (BIT(7))
#define EFUSE_DIS_RTC_RAM_BOOT_ERR_M  (EFUSE_DIS_RTC_RAM_BOOT_ERR_V << EFUSE_DIS_RTC_RAM_BOOT_ERR_S)
#define EFUSE_DIS_RTC_RAM_BOOT_ERR_V  0x00000001
#define EFUSE_DIS_RTC_RAM_BOOT_ERR_S  7

/* EFUSE_RD_DIS_ERR : RO; bitpos: [6:0]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RD_DIS.
 */

#define EFUSE_RD_DIS_ERR    0x0000007F
#define EFUSE_RD_DIS_ERR_M  (EFUSE_RD_DIS_ERR_V << EFUSE_RD_DIS_ERR_S)
#define EFUSE_RD_DIS_ERR_V  0x0000007F
#define EFUSE_RD_DIS_ERR_S  0

/* EFUSE_RD_REPEAT_ERR1_REG register
 * Programming error record register 1 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_ERR1_REG (DR_REG_EFUSE_BASE + 0x180)

/* EFUSE_KEY_PURPOSE_1_ERR : RO; bitpos: [31:28]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_1.
 */

#define EFUSE_KEY_PURPOSE_1_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_1_ERR_M  (EFUSE_KEY_PURPOSE_1_ERR_V << EFUSE_KEY_PURPOSE_1_ERR_S)
#define EFUSE_KEY_PURPOSE_1_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_1_ERR_S  28

/* EFUSE_KEY_PURPOSE_0_ERR : RO; bitpos: [27:24]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_0.
 */

#define EFUSE_KEY_PURPOSE_0_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_0_ERR_M  (EFUSE_KEY_PURPOSE_0_ERR_V << EFUSE_KEY_PURPOSE_0_ERR_S)
#define EFUSE_KEY_PURPOSE_0_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_0_ERR_S  24

/* EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR : RO; bitpos: [23]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_BOOT_KEY_REVOKE2.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR    (BIT(23))
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR_M  (EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR_V << EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE2_ERR_S  23

/* EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR : RO; bitpos: [22]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_BOOT_KEY_REVOKE1.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR    (BIT(22))
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR_M  (EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR_V << EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE1_ERR_S  22

/* EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR : RO; bitpos: [21]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_BOOT_KEY_REVOKE0.
 */

#define EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR    (BIT(21))
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR_M  (EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR_V << EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR_S)
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR_V  0x00000001
#define EFUSE_SECURE_BOOT_KEY_REVOKE0_ERR_S  21

/* EFUSE_SPI_BOOT_CRYPT_CNT_ERR : RO; bitpos: [20:18]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SPI_BOOT_CRYPT_CNT.
 */

#define EFUSE_SPI_BOOT_CRYPT_CNT_ERR    0x00000007
#define EFUSE_SPI_BOOT_CRYPT_CNT_ERR_M  (EFUSE_SPI_BOOT_CRYPT_CNT_ERR_V << EFUSE_SPI_BOOT_CRYPT_CNT_ERR_S)
#define EFUSE_SPI_BOOT_CRYPT_CNT_ERR_V  0x00000007
#define EFUSE_SPI_BOOT_CRYPT_CNT_ERR_S  18

/* EFUSE_WDT_DELAY_SEL_ERR : RO; bitpos: [17:16]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_WDT_DELAY_SEL.
 */

