apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_WDT_DELAY_SEL_ERR    0x00000003
#define EFUSE_WDT_DELAY_SEL_ERR_M  (EFUSE_WDT_DELAY_SEL_ERR_V << EFUSE_WDT_DELAY_SEL_ERR_S)
#define EFUSE_WDT_DELAY_SEL_ERR_V  0x00000003
#define EFUSE_WDT_DELAY_SEL_ERR_S  16

/* EFUSE_VDD_SPI_DCAP_ERR : RO; bitpos: [15:14]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_DCAP.
 */

#define EFUSE_VDD_SPI_DCAP_ERR    0x00000003
#define EFUSE_VDD_SPI_DCAP_ERR_M  (EFUSE_VDD_SPI_DCAP_ERR_V << EFUSE_VDD_SPI_DCAP_ERR_S)
#define EFUSE_VDD_SPI_DCAP_ERR_V  0x00000003
#define EFUSE_VDD_SPI_DCAP_ERR_S  14

/* EFUSE_VDD_SPI_INIT_ERR : RO; bitpos: [13:12]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_INIT.
 */

#define EFUSE_VDD_SPI_INIT_ERR    0x00000003
#define EFUSE_VDD_SPI_INIT_ERR_M  (EFUSE_VDD_SPI_INIT_ERR_V << EFUSE_VDD_SPI_INIT_ERR_S)
#define EFUSE_VDD_SPI_INIT_ERR_V  0x00000003
#define EFUSE_VDD_SPI_INIT_ERR_S  12

/* EFUSE_VDD_SPI_DCURLIM_ERR : RO; bitpos: [11:9]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_DCURLIM.
 */

#define EFUSE_VDD_SPI_DCURLIM_ERR    0x00000007
#define EFUSE_VDD_SPI_DCURLIM_ERR_M  (EFUSE_VDD_SPI_DCURLIM_ERR_V << EFUSE_VDD_SPI_DCURLIM_ERR_S)
#define EFUSE_VDD_SPI_DCURLIM_ERR_V  0x00000007
#define EFUSE_VDD_SPI_DCURLIM_ERR_S  9

/* EFUSE_VDD_SPI_ENCURLIM_ERR : RO; bitpos: [8]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_ENCURLIM.
 */

#define EFUSE_VDD_SPI_ENCURLIM_ERR    (BIT(8))
#define EFUSE_VDD_SPI_ENCURLIM_ERR_M  (EFUSE_VDD_SPI_ENCURLIM_ERR_V << EFUSE_VDD_SPI_ENCURLIM_ERR_S)
#define EFUSE_VDD_SPI_ENCURLIM_ERR_V  0x00000001
#define EFUSE_VDD_SPI_ENCURLIM_ERR_S  8

/* EFUSE_VDD_SPI_EN_INIT_ERR : RO; bitpos: [7]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_EN_INIT.
 */

#define EFUSE_VDD_SPI_EN_INIT_ERR    (BIT(7))
#define EFUSE_VDD_SPI_EN_INIT_ERR_M  (EFUSE_VDD_SPI_EN_INIT_ERR_V << EFUSE_VDD_SPI_EN_INIT_ERR_S)
#define EFUSE_VDD_SPI_EN_INIT_ERR_V  0x00000001
#define EFUSE_VDD_SPI_EN_INIT_ERR_S  7

/* EFUSE_VDD_SPI_FORCE_ERR : RO; bitpos: [6]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_FORCE.
 */

#define EFUSE_VDD_SPI_FORCE_ERR    (BIT(6))
#define EFUSE_VDD_SPI_FORCE_ERR_M  (EFUSE_VDD_SPI_FORCE_ERR_V << EFUSE_VDD_SPI_FORCE_ERR_S)
#define EFUSE_VDD_SPI_FORCE_ERR_V  0x00000001
#define EFUSE_VDD_SPI_FORCE_ERR_S  6

/* EFUSE_VDD_SPI_TIEH_ERR : RO; bitpos: [5]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_TIEH.
 */

#define EFUSE_VDD_SPI_TIEH_ERR    (BIT(5))
#define EFUSE_VDD_SPI_TIEH_ERR_M  (EFUSE_VDD_SPI_TIEH_ERR_V << EFUSE_VDD_SPI_TIEH_ERR_S)
#define EFUSE_VDD_SPI_TIEH_ERR_V  0x00000001
#define EFUSE_VDD_SPI_TIEH_ERR_S  5

/* EFUSE_VDD_SPI_XPD_ERR : RO; bitpos: [4]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_XPD.
 */

#define EFUSE_VDD_SPI_XPD_ERR    (BIT(4))
#define EFUSE_VDD_SPI_XPD_ERR_M  (EFUSE_VDD_SPI_XPD_ERR_V << EFUSE_VDD_SPI_XPD_ERR_S)
#define EFUSE_VDD_SPI_XPD_ERR_V  0x00000001
#define EFUSE_VDD_SPI_XPD_ERR_S  4

/* EFUSE_VDD_SPI_DREFL_ERR : RO; bitpos: [3:2]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_DREFL.
 */

#define EFUSE_VDD_SPI_DREFL_ERR    0x00000003
#define EFUSE_VDD_SPI_DREFL_ERR_M  (EFUSE_VDD_SPI_DREFL_ERR_V << EFUSE_VDD_SPI_DREFL_ERR_S)
#define EFUSE_VDD_SPI_DREFL_ERR_V  0x00000003
#define EFUSE_VDD_SPI_DREFL_ERR_S  2

/* EFUSE_VDD_SPI_DREFM_ERR : RO; bitpos: [1:0]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_VDD_SPI_DREFM.
 */

#define EFUSE_VDD_SPI_DREFM_ERR    0x00000003
#define EFUSE_VDD_SPI_DREFM_ERR_M  (EFUSE_VDD_SPI_DREFM_ERR_V << EFUSE_VDD_SPI_DREFM_ERR_S)
#define EFUSE_VDD_SPI_DREFM_ERR_V  0x00000003
#define EFUSE_VDD_SPI_DREFM_ERR_S  0

/* EFUSE_RD_REPEAT_ERR2_REG register
 * Programming error record register 2 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_ERR2_REG (DR_REG_EFUSE_BASE + 0x184)

/* EFUSE_FLASH_TPUW_ERR : RO; bitpos: [31:28]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_FLASH_TPUW.
 */

#define EFUSE_FLASH_TPUW_ERR    0x0000000F
#define EFUSE_FLASH_TPUW_ERR_M  (EFUSE_FLASH_TPUW_ERR_V << EFUSE_FLASH_TPUW_ERR_S)
#define EFUSE_FLASH_TPUW_ERR_V  0x0000000F
#define EFUSE_FLASH_TPUW_ERR_S  28

/* EFUSE_RPT4_RESERVED1_ERR : RO; bitpos: [27:22]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RPT4_RESERVED1.
 */

#define EFUSE_RPT4_RESERVED1_ERR    0x0000003F
#define EFUSE_RPT4_RESERVED1_ERR_M  (EFUSE_RPT4_RESERVED1_ERR_V << EFUSE_RPT4_RESERVED1_ERR_S)
#define EFUSE_RPT4_RESERVED1_ERR_V  0x0000003F
#define EFUSE_RPT4_RESERVED1_ERR_S  22

/* EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR : RO; bitpos: [21]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE.
 */

#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR    (BIT(21))
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_M  (EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_V << EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_S)
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_V  0x00000001
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_ERR_S  21

/* EFUSE_SECURE_BOOT_EN_ERR : RO; bitpos: [20]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_BOOT_EN.
 */

#define EFUSE_SECURE_BOOT_EN_ERR    (BIT(20))
#define EFUSE_SECURE_BOOT_EN_ERR_M  (EFUSE_SECURE_BOOT_EN_ERR_V << EFUSE_SECURE_BOOT_EN_ERR_S)
#define EFUSE_SECURE_BOOT_EN_ERR_V  0x00000001
#define EFUSE_SECURE_BOOT_EN_ERR_S  20

/* EFUSE_KEY_PURPOSE_6_ERR : RO; bitpos: [19:16]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_6.
 */

#define EFUSE_KEY_PURPOSE_6_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_6_ERR_M  (EFUSE_KEY_PURPOSE_6_ERR_V << EFUSE_KEY_PURPOSE_6_ERR_S)
#define EFUSE_KEY_PURPOSE_6_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_6_ERR_S  16

/* EFUSE_KEY_PURPOSE_5_ERR : RO; bitpos: [15:12]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_5.
 */

#define EFUSE_KEY_PURPOSE_5_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_5_ERR_M  (EFUSE_KEY_PURPOSE_5_ERR_V << EFUSE_KEY_PURPOSE_5_ERR_S)
#define EFUSE_KEY_PURPOSE_5_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_5_ERR_S  12

/* EFUSE_KEY_PURPOSE_4_ERR : RO; bitpos: [11:8]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_4.
 */

#define EFUSE_KEY_PURPOSE_4_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_4_ERR_M  (EFUSE_KEY_PURPOSE_4_ERR_V << EFUSE_KEY_PURPOSE_4_ERR_S)
#define EFUSE_KEY_PURPOSE_4_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_4_ERR_S  8

