apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_KEY_PURPOSE_3_ERR : RO; bitpos: [7:4]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_3.
 */

#define EFUSE_KEY_PURPOSE_3_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_3_ERR_M  (EFUSE_KEY_PURPOSE_3_ERR_V << EFUSE_KEY_PURPOSE_3_ERR_S)
#define EFUSE_KEY_PURPOSE_3_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_3_ERR_S  4

/* EFUSE_KEY_PURPOSE_2_ERR : RO; bitpos: [3:0]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_KEY_PURPOSE_2.
 */

#define EFUSE_KEY_PURPOSE_2_ERR    0x0000000F
#define EFUSE_KEY_PURPOSE_2_ERR_M  (EFUSE_KEY_PURPOSE_2_ERR_V << EFUSE_KEY_PURPOSE_2_ERR_S)
#define EFUSE_KEY_PURPOSE_2_ERR_V  0x0000000F
#define EFUSE_KEY_PURPOSE_2_ERR_S  0

/* EFUSE_RD_REPEAT_ERR3_REG register
 * Programming error record register 3 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_ERR3_REG (DR_REG_EFUSE_BASE + 0x188)

/* EFUSE_RPT4_RESERVED2_ERR : RO; bitpos: [31:27]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RPT4_RESERVED2.
 */

#define EFUSE_RPT4_RESERVED2_ERR    0x0000001F
#define EFUSE_RPT4_RESERVED2_ERR_M  (EFUSE_RPT4_RESERVED2_ERR_V << EFUSE_RPT4_RESERVED2_ERR_S)
#define EFUSE_RPT4_RESERVED2_ERR_V  0x0000001F
#define EFUSE_RPT4_RESERVED2_ERR_S  27

/* EFUSE_SECURE_VERSION_ERR : RO; bitpos: [26:11]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_SECURE_VERSION.
 */

#define EFUSE_SECURE_VERSION_ERR    0x0000FFFF
#define EFUSE_SECURE_VERSION_ERR_M  (EFUSE_SECURE_VERSION_ERR_V << EFUSE_SECURE_VERSION_ERR_S)
#define EFUSE_SECURE_VERSION_ERR_V  0x0000FFFF
#define EFUSE_SECURE_VERSION_ERR_S  11

/* EFUSE_FORCE_SEND_RESUME_ERR : RO; bitpos: [10]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_FORCE_SEND_RESUME.
 */

#define EFUSE_FORCE_SEND_RESUME_ERR    (BIT(10))
#define EFUSE_FORCE_SEND_RESUME_ERR_M  (EFUSE_FORCE_SEND_RESUME_ERR_V << EFUSE_FORCE_SEND_RESUME_ERR_S)
#define EFUSE_FORCE_SEND_RESUME_ERR_V  0x00000001
#define EFUSE_FORCE_SEND_RESUME_ERR_S  10

/* EFUSE_FLASH_TYPE_ERR : RO; bitpos: [9]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_FLASH_TYPE.
 */

#define EFUSE_FLASH_TYPE_ERR    (BIT(9))
#define EFUSE_FLASH_TYPE_ERR_M  (EFUSE_FLASH_TYPE_ERR_V << EFUSE_FLASH_TYPE_ERR_S)
#define EFUSE_FLASH_TYPE_ERR_V  0x00000001
#define EFUSE_FLASH_TYPE_ERR_S  9

/* EFUSE_PIN_POWER_SELECTION_ERR : RO; bitpos: [8]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_PIN_POWER_SELECTION.
 */

#define EFUSE_PIN_POWER_SELECTION_ERR    (BIT(8))
#define EFUSE_PIN_POWER_SELECTION_ERR_M  (EFUSE_PIN_POWER_SELECTION_ERR_V << EFUSE_PIN_POWER_SELECTION_ERR_S)
#define EFUSE_PIN_POWER_SELECTION_ERR_V  0x00000001
#define EFUSE_PIN_POWER_SELECTION_ERR_S  8

/* EFUSE_UART_PRINT_CONTROL_ERR : RO; bitpos: [7:6]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_UART_PRINT_CONTROL.
 */

#define EFUSE_UART_PRINT_CONTROL_ERR    0x00000003
#define EFUSE_UART_PRINT_CONTROL_ERR_M  (EFUSE_UART_PRINT_CONTROL_ERR_V << EFUSE_UART_PRINT_CONTROL_ERR_S)
#define EFUSE_UART_PRINT_CONTROL_ERR_V  0x00000003
#define EFUSE_UART_PRINT_CONTROL_ERR_S  6

/* EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR : RO; bitpos: [5]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_ENABLE_SECURITY_DOWNLOAD.
 */

#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR    (BIT(5))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_V  0x00000001
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_ERR_S  5

/* EFUSE_DIS_USB_DOWNLOAD_MODE_ERR : RO; bitpos: [4]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_USB_DOWNLOAD_MODE.
 */

#define EFUSE_DIS_USB_DOWNLOAD_MODE_ERR    (BIT(4))
#define EFUSE_DIS_USB_DOWNLOAD_MODE_ERR_M  (EFUSE_DIS_USB_DOWNLOAD_MODE_ERR_V << EFUSE_DIS_USB_DOWNLOAD_MODE_ERR_S)
#define EFUSE_DIS_USB_DOWNLOAD_MODE_ERR_V  0x00000001
#define EFUSE_DIS_USB_DOWNLOAD_MODE_ERR_S  4

/* EFUSE_RPT4_RESERVED3_ERR : RO; bitpos: [3]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RPT4_RESERVED3.
 */

#define EFUSE_RPT4_RESERVED3_ERR    (BIT(3))
#define EFUSE_RPT4_RESERVED3_ERR_M  (EFUSE_RPT4_RESERVED3_ERR_V << EFUSE_RPT4_RESERVED3_ERR_S)
#define EFUSE_RPT4_RESERVED3_ERR_V  0x00000001
#define EFUSE_RPT4_RESERVED3_ERR_S  3

/* EFUSE_UART_PRINT_CHANNEL_ERR : RO; bitpos: [2]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_UART_PRINT_CHANNEL.
 */

#define EFUSE_UART_PRINT_CHANNEL_ERR    (BIT(2))
#define EFUSE_UART_PRINT_CHANNEL_ERR_M  (EFUSE_UART_PRINT_CHANNEL_ERR_V << EFUSE_UART_PRINT_CHANNEL_ERR_S)
#define EFUSE_UART_PRINT_CHANNEL_ERR_V  0x00000001
#define EFUSE_UART_PRINT_CHANNEL_ERR_S  2

/* EFUSE_DIS_LEGACY_SPI_BOOT_ERR : RO; bitpos: [1]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_LEGACY_SPI_BOOT.
 */

#define EFUSE_DIS_LEGACY_SPI_BOOT_ERR    (BIT(1))
#define EFUSE_DIS_LEGACY_SPI_BOOT_ERR_M  (EFUSE_DIS_LEGACY_SPI_BOOT_ERR_V << EFUSE_DIS_LEGACY_SPI_BOOT_ERR_S)
#define EFUSE_DIS_LEGACY_SPI_BOOT_ERR_V  0x00000001
#define EFUSE_DIS_LEGACY_SPI_BOOT_ERR_S  1

/* EFUSE_DIS_DOWNLOAD_MODE_ERR : RO; bitpos: [0]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_DIS_DOWNLOAD_MODE.
 */

#define EFUSE_DIS_DOWNLOAD_MODE_ERR    (BIT(0))
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_M  (EFUSE_DIS_DOWNLOAD_MODE_ERR_V << EFUSE_DIS_DOWNLOAD_MODE_ERR_S)
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_V  0x00000001
#define EFUSE_DIS_DOWNLOAD_MODE_ERR_S  0

/* EFUSE_RD_REPEAT_ERR4_REG register
 * Programming error record register 4 of BLOCK0.
 */

#define EFUSE_RD_REPEAT_ERR4_REG (DR_REG_EFUSE_BASE + 0x190)

/* EFUSE_RPT4_RESERVED4_ERR : RO; bitpos: [23:0]; default: 0;
 * If any bit in this parameter is 1, means a programming error in
 * EFUSE_RPT4_RESERVED4.
 */

#define EFUSE_RPT4_RESERVED4_ERR    0x00FFFFFF
#define EFUSE_RPT4_RESERVED4_ERR_M  (EFUSE_RPT4_RESERVED4_ERR_V << EFUSE_RPT4_RESERVED4_ERR_S)
#define EFUSE_RPT4_RESERVED4_ERR_V  0x00FFFFFF
#define EFUSE_RPT4_RESERVED4_ERR_S  0

/* EFUSE_RD_RS_ERR0_REG register
 * Programming error record register 0 of BLOCK1-10.
 */

#define EFUSE_RD_RS_ERR0_REG (DR_REG_EFUSE_BASE + 0x1c0)

/* EFUSE_KEY4_FAIL : RO; bitpos: [31]; default: 0;
 * 0: Means no failure and that the data of KEY4 is reliable; 1: Means that
 * programming KEY4 failed and the number of error bytes is over 5.
 */

