apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_KEY4_FAIL    (BIT(31))
#define EFUSE_KEY4_FAIL_M  (EFUSE_KEY4_FAIL_V << EFUSE_KEY4_FAIL_S)
#define EFUSE_KEY4_FAIL_V  0x00000001
#define EFUSE_KEY4_FAIL_S  31

/* EFUSE_KEY4_ERR_NUM : RO; bitpos: [30:28]; default: 0;
 * The value of this signal means the number of error bytes in KEY4.
 */

#define EFUSE_KEY4_ERR_NUM    0x00000007
#define EFUSE_KEY4_ERR_NUM_M  (EFUSE_KEY4_ERR_NUM_V << EFUSE_KEY4_ERR_NUM_S)
#define EFUSE_KEY4_ERR_NUM_V  0x00000007
#define EFUSE_KEY4_ERR_NUM_S  28

/* EFUSE_KEY3_FAIL : RO; bitpos: [27]; default: 0;
 * 0: Means no failure and that the data of KEY3 is reliable; 1: Means that
 * programming KEY3 failed and the number of error bytes is over 5.
 */

#define EFUSE_KEY3_FAIL    (BIT(27))
#define EFUSE_KEY3_FAIL_M  (EFUSE_KEY3_FAIL_V << EFUSE_KEY3_FAIL_S)
#define EFUSE_KEY3_FAIL_V  0x00000001
#define EFUSE_KEY3_FAIL_S  27

/* EFUSE_KEY3_ERR_NUM : RO; bitpos: [26:24]; default: 0;
 * The value of this signal means the number of error bytes in KEY3.
 */

#define EFUSE_KEY3_ERR_NUM    0x00000007
#define EFUSE_KEY3_ERR_NUM_M  (EFUSE_KEY3_ERR_NUM_V << EFUSE_KEY3_ERR_NUM_S)
#define EFUSE_KEY3_ERR_NUM_V  0x00000007
#define EFUSE_KEY3_ERR_NUM_S  24

/* EFUSE_KEY2_FAIL : RO; bitpos: [23]; default: 0;
 * 0: Means no failure and that the data of KEY2 is reliable; 1: Means that
 * programming KEY2 failed and the number of error bytes is over 5.
 */

#define EFUSE_KEY2_FAIL    (BIT(23))
#define EFUSE_KEY2_FAIL_M  (EFUSE_KEY2_FAIL_V << EFUSE_KEY2_FAIL_S)
#define EFUSE_KEY2_FAIL_V  0x00000001
#define EFUSE_KEY2_FAIL_S  23

/* EFUSE_KEY2_ERR_NUM : RO; bitpos: [22:20]; default: 0;
 * The value of this signal means the number of error bytes in KEY2.
 */

#define EFUSE_KEY2_ERR_NUM    0x00000007
#define EFUSE_KEY2_ERR_NUM_M  (EFUSE_KEY2_ERR_NUM_V << EFUSE_KEY2_ERR_NUM_S)
#define EFUSE_KEY2_ERR_NUM_V  0x00000007
#define EFUSE_KEY2_ERR_NUM_S  20

/* EFUSE_KEY1_FAIL : RO; bitpos: [19]; default: 0;
 * 0: Means no failure and that the data of KEY1 is reliable; 1: Means that
 * programming KEY1 failed and the number of error bytes is over 5.
 */

#define EFUSE_KEY1_FAIL    (BIT(19))
#define EFUSE_KEY1_FAIL_M  (EFUSE_KEY1_FAIL_V << EFUSE_KEY1_FAIL_S)
#define EFUSE_KEY1_FAIL_V  0x00000001
#define EFUSE_KEY1_FAIL_S  19

/* EFUSE_KEY1_ERR_NUM : RO; bitpos: [18:16]; default: 0;
 * The value of this signal means the number of error bytes in KEY1.
 */

#define EFUSE_KEY1_ERR_NUM    0x00000007
#define EFUSE_KEY1_ERR_NUM_M  (EFUSE_KEY1_ERR_NUM_V << EFUSE_KEY1_ERR_NUM_S)
#define EFUSE_KEY1_ERR_NUM_V  0x00000007
#define EFUSE_KEY1_ERR_NUM_S  16

/* EFUSE_KEY0_FAIL : RO; bitpos: [15]; default: 0;
 * 0: Means no failure and that the data of KEY0 is reliable; 1: Means that
 * programming KEY0 failed and the number of error bytes is over 5.
 */

#define EFUSE_KEY0_FAIL    (BIT(15))
#define EFUSE_KEY0_FAIL_M  (EFUSE_KEY0_FAIL_V << EFUSE_KEY0_FAIL_S)
#define EFUSE_KEY0_FAIL_V  0x00000001
#define EFUSE_KEY0_FAIL_S  15

/* EFUSE_KEY0_ERR_NUM : RO; bitpos: [14:12]; default: 0;
 * The value of this signal means the number of error bytes in KEY0.
 */

#define EFUSE_KEY0_ERR_NUM    0x00000007
#define EFUSE_KEY0_ERR_NUM_M  (EFUSE_KEY0_ERR_NUM_V << EFUSE_KEY0_ERR_NUM_S)
#define EFUSE_KEY0_ERR_NUM_V  0x00000007
#define EFUSE_KEY0_ERR_NUM_S  12

/* EFUSE_USR_DATA_FAIL : RO; bitpos: [11]; default: 0;
 * 0: Means no failure and that the data of BLOCK3 is reliable; 1: Means
 * that programming BLOCK3 data failed and the number of error bytes is over
 * 5.
 */

#define EFUSE_USR_DATA_FAIL    (BIT(11))
#define EFUSE_USR_DATA_FAIL_M  (EFUSE_USR_DATA_FAIL_V << EFUSE_USR_DATA_FAIL_S)
#define EFUSE_USR_DATA_FAIL_V  0x00000001
#define EFUSE_USR_DATA_FAIL_S  11

/* EFUSE_USR_DATA_ERR_NUM : RO; bitpos: [10:8]; default: 0;
 * The value of this signal means the number of error bytes in BLOCK3.
 */

#define EFUSE_USR_DATA_ERR_NUM    0x00000007
#define EFUSE_USR_DATA_ERR_NUM_M  (EFUSE_USR_DATA_ERR_NUM_V << EFUSE_USR_DATA_ERR_NUM_S)
#define EFUSE_USR_DATA_ERR_NUM_V  0x00000007
#define EFUSE_USR_DATA_ERR_NUM_S  8

/* EFUSE_SYS_PART1_FAIL : RO; bitpos: [7]; default: 0;
 * 0: Means no failure and that the data of BLOCK2 is reliable; 1: Means
 * that programming BLOCK2 data failed and the number of error bytes is over
 * 5.
 */

#define EFUSE_SYS_PART1_FAIL    (BIT(7))
#define EFUSE_SYS_PART1_FAIL_M  (EFUSE_SYS_PART1_FAIL_V << EFUSE_SYS_PART1_FAIL_S)
#define EFUSE_SYS_PART1_FAIL_V  0x00000001
#define EFUSE_SYS_PART1_FAIL_S  7

/* EFUSE_SYS_PART1_NUM : RO; bitpos: [6:4]; default: 0;
 * The value of this signal means the number of error bytes in BLOCK2.
 */

#define EFUSE_SYS_PART1_NUM    0x00000007
#define EFUSE_SYS_PART1_NUM_M  (EFUSE_SYS_PART1_NUM_V << EFUSE_SYS_PART1_NUM_S)
#define EFUSE_SYS_PART1_NUM_V  0x00000007
#define EFUSE_SYS_PART1_NUM_S  4

/* EFUSE_MAC_SPI_8M_FAIL : RO; bitpos: [3]; default: 0;
 * 0: Means no failure and that the data of BLOCK1 is reliable; 1: Means
 * that programming BLOCK1 data failed and the number of error bytes is over
 * 5.
 */

#define EFUSE_MAC_SPI_8M_FAIL    (BIT(3))
#define EFUSE_MAC_SPI_8M_FAIL_M  (EFUSE_MAC_SPI_8M_FAIL_V << EFUSE_MAC_SPI_8M_FAIL_S)
#define EFUSE_MAC_SPI_8M_FAIL_V  0x00000001
#define EFUSE_MAC_SPI_8M_FAIL_S  3

/* EFUSE_MAC_SPI_8M_ERR_NUM : RO; bitpos: [2:0]; default: 0;
 * The value of this signal means the number of error bytes in BLOCK1.
 */

#define EFUSE_MAC_SPI_8M_ERR_NUM    0x00000007
#define EFUSE_MAC_SPI_8M_ERR_NUM_M  (EFUSE_MAC_SPI_8M_ERR_NUM_V << EFUSE_MAC_SPI_8M_ERR_NUM_S)
#define EFUSE_MAC_SPI_8M_ERR_NUM_V  0x00000007
#define EFUSE_MAC_SPI_8M_ERR_NUM_S  0

/* EFUSE_RD_RS_ERR1_REG register
 * Programming error record register 1 of BLOCK1-10.
 */

#define EFUSE_RD_RS_ERR1_REG (DR_REG_EFUSE_BASE + 0x1c4)

/* EFUSE_SYS_PART2_FAIL : RO; bitpos: [7]; default: 0;
 * 0: Means no failure and that the data of BLOCK10 is reliable; 1: Means
 * that programming BLOCK10 data failed and the number of error bytes is
 * over 5.
 */

#define EFUSE_SYS_PART2_FAIL    (BIT(7))
#define EFUSE_SYS_PART2_FAIL_M  (EFUSE_SYS_PART2_FAIL_V << EFUSE_SYS_PART2_FAIL_S)
#define EFUSE_SYS_PART2_FAIL_V  0x00000001
#define EFUSE_SYS_PART2_FAIL_S  7

/* EFUSE_SYS_PART2_ERR_NUM : RO; bitpos: [6:4]; default: 0;
 * The value of this signal means the number of error bytes in BLOCK10.
 */

#define EFUSE_SYS_PART2_ERR_NUM    0x00000007
#define EFUSE_SYS_PART2_ERR_NUM_M  (EFUSE_SYS_PART2_ERR_NUM_V << EFUSE_SYS_PART2_ERR_NUM_S)
#define EFUSE_SYS_PART2_ERR_NUM_V  0x00000007
#define EFUSE_SYS_PART2_ERR_NUM_S  4

/* EFUSE_KEY5_FAIL : RO; bitpos: [3]; default: 0;
 * 0: Means no failure and that the data of KEY5 is reliable; 1: Means that
 * programming user data failed and the number of error bytes is over 5.
 */

