apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_KEY5_FAIL    (BIT(3))
#define EFUSE_KEY5_FAIL_M  (EFUSE_KEY5_FAIL_V << EFUSE_KEY5_FAIL_S)
#define EFUSE_KEY5_FAIL_V  0x00000001
#define EFUSE_KEY5_FAIL_S  3

/* EFUSE_KEY5_ERR_NUM : RO; bitpos: [2:0]; default: 0;
 * The value of this signal means the number of error bytes in KEY5.
 */

#define EFUSE_KEY5_ERR_NUM    0x00000007
#define EFUSE_KEY5_ERR_NUM_M  (EFUSE_KEY5_ERR_NUM_V << EFUSE_KEY5_ERR_NUM_S)
#define EFUSE_KEY5_ERR_NUM_V  0x00000007
#define EFUSE_KEY5_ERR_NUM_S  0

/* EFUSE_CLK_REG register
 * eFuse clock configuration register.
 */

#define EFUSE_CLK_REG (DR_REG_EFUSE_BASE + 0x1c8)

/* EFUSE_CLK_EN : R/W; bitpos: [16]; default: 0;
 * If set, forces to enable clock signal of eFuse memory.
 */

#define EFUSE_CLK_EN    (BIT(16))
#define EFUSE_CLK_EN_M  (EFUSE_CLK_EN_V << EFUSE_CLK_EN_S)
#define EFUSE_CLK_EN_V  0x00000001
#define EFUSE_CLK_EN_S  16

/* EFUSE_EFUSE_MEM_FORCE_PU : R/W; bitpos: [2]; default: 0;
 * If set, forces eFuse SRAM into working mode.
 */

#define EFUSE_EFUSE_MEM_FORCE_PU    (BIT(2))
#define EFUSE_EFUSE_MEM_FORCE_PU_M  (EFUSE_EFUSE_MEM_FORCE_PU_V << EFUSE_EFUSE_MEM_FORCE_PU_S)
#define EFUSE_EFUSE_MEM_FORCE_PU_V  0x00000001
#define EFUSE_EFUSE_MEM_FORCE_PU_S  2

/* EFUSE_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 1;
 * If set, forces to activate clock signal of eFuse SRAM.
 */

#define EFUSE_MEM_CLK_FORCE_ON    (BIT(1))
#define EFUSE_MEM_CLK_FORCE_ON_M  (EFUSE_MEM_CLK_FORCE_ON_V << EFUSE_MEM_CLK_FORCE_ON_S)
#define EFUSE_MEM_CLK_FORCE_ON_V  0x00000001
#define EFUSE_MEM_CLK_FORCE_ON_S  1

/* EFUSE_EFUSE_MEM_FORCE_PD : R/W; bitpos: [0]; default: 0;
 * If set, forces eFuse SRAM into power-saving mode.
 */

#define EFUSE_EFUSE_MEM_FORCE_PD    (BIT(0))
#define EFUSE_EFUSE_MEM_FORCE_PD_M  (EFUSE_EFUSE_MEM_FORCE_PD_V << EFUSE_EFUSE_MEM_FORCE_PD_S)
#define EFUSE_EFUSE_MEM_FORCE_PD_V  0x00000001
#define EFUSE_EFUSE_MEM_FORCE_PD_S  0

/* EFUSE_CONF_REG register
 * eFuse operation mode configuration register.
 */

#define EFUSE_CONF_REG (DR_REG_EFUSE_BASE + 0x1cc)

/* EFUSE_OP_CODE : R/W; bitpos: [15:0]; default: 0;
 * 0x5A5A: Operate programming command; 0x5AA5: Operate read command.
 */

#define EFUSE_OP_CODE    0x0000FFFF
#define EFUSE_OP_CODE_M  (EFUSE_OP_CODE_V << EFUSE_OP_CODE_S)
#define EFUSE_OP_CODE_V  0x0000FFFF
#define EFUSE_OP_CODE_S  0

/* EFUSE_STATUS_REG register
 * eFuse status register.
 */

#define EFUSE_STATUS_REG (DR_REG_EFUSE_BASE + 0x1d0)

/* EFUSE_REPEAT_ERR_CNT : RO; bitpos: [17:10]; default: 0;
 * Indicates the number of error bits during programming BLOCK0.
 */

#define EFUSE_REPEAT_ERR_CNT    0x000000FF
#define EFUSE_REPEAT_ERR_CNT_M  (EFUSE_REPEAT_ERR_CNT_V << EFUSE_REPEAT_ERR_CNT_S)
#define EFUSE_REPEAT_ERR_CNT_V  0x000000FF
#define EFUSE_REPEAT_ERR_CNT_S  10

/* EFUSE_OTP_VDDQ_IS_SW : RO; bitpos: [9]; default: 0;
 * The value of OTP_VDDQ_IS_SW.
 */

#define EFUSE_OTP_VDDQ_IS_SW    (BIT(9))
#define EFUSE_OTP_VDDQ_IS_SW_M  (EFUSE_OTP_VDDQ_IS_SW_V << EFUSE_OTP_VDDQ_IS_SW_S)
#define EFUSE_OTP_VDDQ_IS_SW_V  0x00000001
#define EFUSE_OTP_VDDQ_IS_SW_S  9

/* EFUSE_OTP_PGENB_SW : RO; bitpos: [8]; default: 0;
 * The value of OTP_PGENB_SW.
 */

#define EFUSE_OTP_PGENB_SW    (BIT(8))
#define EFUSE_OTP_PGENB_SW_M  (EFUSE_OTP_PGENB_SW_V << EFUSE_OTP_PGENB_SW_S)
#define EFUSE_OTP_PGENB_SW_V  0x00000001
#define EFUSE_OTP_PGENB_SW_S  8

/* EFUSE_OTP_CSB_SW : RO; bitpos: [7]; default: 0;
 * The value of OTP_CSB_SW.
 */

#define EFUSE_OTP_CSB_SW    (BIT(7))
#define EFUSE_OTP_CSB_SW_M  (EFUSE_OTP_CSB_SW_V << EFUSE_OTP_CSB_SW_S)
#define EFUSE_OTP_CSB_SW_V  0x00000001
#define EFUSE_OTP_CSB_SW_S  7

/* EFUSE_OTP_STROBE_SW : RO; bitpos: [6]; default: 0;
 * The value of OTP_STROBE_SW.
 */

#define EFUSE_OTP_STROBE_SW    (BIT(6))
#define EFUSE_OTP_STROBE_SW_M  (EFUSE_OTP_STROBE_SW_V << EFUSE_OTP_STROBE_SW_S)
#define EFUSE_OTP_STROBE_SW_V  0x00000001
#define EFUSE_OTP_STROBE_SW_S  6

/* EFUSE_OTP_VDDQ_C_SYNC2 : RO; bitpos: [5]; default: 0;
 * The value of OTP_VDDQ_C_SYNC2.
 */

#define EFUSE_OTP_VDDQ_C_SYNC2    (BIT(5))
#define EFUSE_OTP_VDDQ_C_SYNC2_M  (EFUSE_OTP_VDDQ_C_SYNC2_V << EFUSE_OTP_VDDQ_C_SYNC2_S)
#define EFUSE_OTP_VDDQ_C_SYNC2_V  0x00000001
#define EFUSE_OTP_VDDQ_C_SYNC2_S  5

/* EFUSE_OTP_LOAD_SW : RO; bitpos: [4]; default: 0;
 * The value of OTP_LOAD_SW.
 */

#define EFUSE_OTP_LOAD_SW    (BIT(4))
#define EFUSE_OTP_LOAD_SW_M  (EFUSE_OTP_LOAD_SW_V << EFUSE_OTP_LOAD_SW_S)
#define EFUSE_OTP_LOAD_SW_V  0x00000001
#define EFUSE_OTP_LOAD_SW_S  4

/* EFUSE_STATE : RO; bitpos: [3:0]; default: 0;
 * Indicates the state of the eFuse state machine.
 */

#define EFUSE_STATE    0x0000000F
#define EFUSE_STATE_M  (EFUSE_STATE_V << EFUSE_STATE_S)
#define EFUSE_STATE_V  0x0000000F
#define EFUSE_STATE_S  0

/* EFUSE_CMD_REG register
 * eFuse command register.
 */

#define EFUSE_CMD_REG (DR_REG_EFUSE_BASE + 0x1d4)

/* EFUSE_BLK_NUM : R/W; bitpos: [5:2]; default: 0;
 * The serial number of the block to be programmed. Value 0-10 corresponds
 * to block number 0-10, respectively.
 */

#define EFUSE_BLK_NUM    0x0000000F
#define EFUSE_BLK_NUM_M  (EFUSE_BLK_NUM_V << EFUSE_BLK_NUM_S)
#define EFUSE_BLK_NUM_V  0x0000000F
#define EFUSE_BLK_NUM_S  2

/* EFUSE_PGM_CMD : R/W; bitpos: [1]; default: 0;
 * Set this bit to send programming command.
 */

#define EFUSE_PGM_CMD    (BIT(1))
#define EFUSE_PGM_CMD_M  (EFUSE_PGM_CMD_V << EFUSE_PGM_CMD_S)
#define EFUSE_PGM_CMD_V  0x00000001
#define EFUSE_PGM_CMD_S  1

/* EFUSE_READ_CMD : R/W; bitpos: [0]; default: 0;
 * Set this bit to send read command.
 */

#define EFUSE_READ_CMD    (BIT(0))
#define EFUSE_READ_CMD_M  (EFUSE_READ_CMD_V << EFUSE_READ_CMD_S)
#define EFUSE_READ_CMD_V  0x00000001
#define EFUSE_READ_CMD_S  0

/* EFUSE_INT_RAW_REG register
 * eFuse raw interrupt register.
 */

#define EFUSE_INT_RAW_REG (DR_REG_EFUSE_BASE + 0x1d8)

/* EFUSE_PGM_DONE_INT_RAW : RO; bitpos: [1]; default: 0;
 * The raw bit signal for pgm_done interrupt.
 */

#define EFUSE_PGM_DONE_INT_RAW    (BIT(1))
#define EFUSE_PGM_DONE_INT_RAW_M  (EFUSE_PGM_DONE_INT_RAW_V << EFUSE_PGM_DONE_INT_RAW_S)
#define EFUSE_PGM_DONE_INT_RAW_V  0x00000001
#define EFUSE_PGM_DONE_INT_RAW_S  1

