apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
/* EFUSE_READ_DONE_INT_RAW : RO; bitpos: [0]; default: 0;
 * The raw bit signal for read_done interrupt.
 */

#define EFUSE_READ_DONE_INT_RAW    (BIT(0))
#define EFUSE_READ_DONE_INT_RAW_M  (EFUSE_READ_DONE_INT_RAW_V << EFUSE_READ_DONE_INT_RAW_S)
#define EFUSE_READ_DONE_INT_RAW_V  0x00000001
#define EFUSE_READ_DONE_INT_RAW_S  0

/* EFUSE_INT_ST_REG register
 * eFuse interrupt status register.
 */

#define EFUSE_INT_ST_REG (DR_REG_EFUSE_BASE + 0x1dc)

/* EFUSE_PGM_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 * The status signal for pgm_done interrupt.
 */

#define EFUSE_PGM_DONE_INT_ST    (BIT(1))
#define EFUSE_PGM_DONE_INT_ST_M  (EFUSE_PGM_DONE_INT_ST_V << EFUSE_PGM_DONE_INT_ST_S)
#define EFUSE_PGM_DONE_INT_ST_V  0x00000001
#define EFUSE_PGM_DONE_INT_ST_S  1

/* EFUSE_READ_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 * The status signal for read_done interrupt.
 */

#define EFUSE_READ_DONE_INT_ST    (BIT(0))
#define EFUSE_READ_DONE_INT_ST_M  (EFUSE_READ_DONE_INT_ST_V << EFUSE_READ_DONE_INT_ST_S)
#define EFUSE_READ_DONE_INT_ST_V  0x00000001
#define EFUSE_READ_DONE_INT_ST_S  0

/* EFUSE_INT_ENA_REG register
 * eFuse interrupt enable register.
 */

#define EFUSE_INT_ENA_REG (DR_REG_EFUSE_BASE + 0x1e0)

/* EFUSE_PGM_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The enable signal for pgm_done interrupt.
 */

#define EFUSE_PGM_DONE_INT_ENA    (BIT(1))
#define EFUSE_PGM_DONE_INT_ENA_M  (EFUSE_PGM_DONE_INT_ENA_V << EFUSE_PGM_DONE_INT_ENA_S)
#define EFUSE_PGM_DONE_INT_ENA_V  0x00000001
#define EFUSE_PGM_DONE_INT_ENA_S  1

/* EFUSE_READ_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The enable signal for read_done interrupt.
 */

#define EFUSE_READ_DONE_INT_ENA    (BIT(0))
#define EFUSE_READ_DONE_INT_ENA_M  (EFUSE_READ_DONE_INT_ENA_V << EFUSE_READ_DONE_INT_ENA_S)
#define EFUSE_READ_DONE_INT_ENA_V  0x00000001
#define EFUSE_READ_DONE_INT_ENA_S  0

/* EFUSE_INT_CLR_REG register
 * eFuse interrupt clear register.
 */

#define EFUSE_INT_CLR_REG (DR_REG_EFUSE_BASE + 0x1e4)

/* EFUSE_PGM_DONE_INT_CLR : WO; bitpos: [1]; default: 0;
 * The clear signal for pgm_done interrupt.
 */

#define EFUSE_PGM_DONE_INT_CLR    (BIT(1))
#define EFUSE_PGM_DONE_INT_CLR_M  (EFUSE_PGM_DONE_INT_CLR_V << EFUSE_PGM_DONE_INT_CLR_S)
#define EFUSE_PGM_DONE_INT_CLR_V  0x00000001
#define EFUSE_PGM_DONE_INT_CLR_S  1

/* EFUSE_READ_DONE_INT_CLR : WO; bitpos: [0]; default: 0;
 * The clear signal for read_done interrupt.
 */

#define EFUSE_READ_DONE_INT_CLR    (BIT(0))
#define EFUSE_READ_DONE_INT_CLR_M  (EFUSE_READ_DONE_INT_CLR_V << EFUSE_READ_DONE_INT_CLR_S)
#define EFUSE_READ_DONE_INT_CLR_V  0x00000001
#define EFUSE_READ_DONE_INT_CLR_S  0

/* EFUSE_DAC_CONF_REG register
 * Controls the eFuse programming voltage.
 */

#define EFUSE_DAC_CONF_REG (DR_REG_EFUSE_BASE + 0x1e8)

/* EFUSE_OE_CLR : R/W; bitpos: [17]; default: 0;
 * Reduces the power supply of the programming voltage.
 */

#define EFUSE_OE_CLR    (BIT(17))
#define EFUSE_OE_CLR_M  (EFUSE_OE_CLR_V << EFUSE_OE_CLR_S)
#define EFUSE_OE_CLR_V  0x00000001
#define EFUSE_OE_CLR_S  17

/* EFUSE_DAC_NUM : R/W; bitpos: [16:9]; default: 255;
 * Controls the rising period of the programming voltage.
 */

#define EFUSE_DAC_NUM    0x000000FF
#define EFUSE_DAC_NUM_M  (EFUSE_DAC_NUM_V << EFUSE_DAC_NUM_S)
#define EFUSE_DAC_NUM_V  0x000000FF
#define EFUSE_DAC_NUM_S  9

/* EFUSE_DAC_CLK_PAD_SEL : R/W; bitpos: [8]; default: 0;
 * Don't care.
 */

#define EFUSE_DAC_CLK_PAD_SEL    (BIT(8))
#define EFUSE_DAC_CLK_PAD_SEL_M  (EFUSE_DAC_CLK_PAD_SEL_V << EFUSE_DAC_CLK_PAD_SEL_S)
#define EFUSE_DAC_CLK_PAD_SEL_V  0x00000001
#define EFUSE_DAC_CLK_PAD_SEL_S  8

/* EFUSE_DAC_CLK_DIV : R/W; bitpos: [7:0]; default: 28;
 * Controls the division factor of the rising clock of the programming
 * voltage.
 */

#define EFUSE_DAC_CLK_DIV    0x000000FF
#define EFUSE_DAC_CLK_DIV_M  (EFUSE_DAC_CLK_DIV_V << EFUSE_DAC_CLK_DIV_S)
#define EFUSE_DAC_CLK_DIV_V  0x000000FF
#define EFUSE_DAC_CLK_DIV_S  0

/* EFUSE_RD_TIM_CONF_REG register
 * Configures read timing parameters.
 */

#define EFUSE_RD_TIM_CONF_REG (DR_REG_EFUSE_BASE + 0x1ec)

/* EFUSE_READ_INIT_NUM : R/W; bitpos: [31:24]; default: 18;
 * Configures the initial read time of eFuse.
 */

#define EFUSE_READ_INIT_NUM    0x000000FF
#define EFUSE_READ_INIT_NUM_M  (EFUSE_READ_INIT_NUM_V << EFUSE_READ_INIT_NUM_S)
#define EFUSE_READ_INIT_NUM_V  0x000000FF
#define EFUSE_READ_INIT_NUM_S  24

/* EFUSE_TSUR_A : R/W; bitpos: [23:16]; default: 1;
 * Configures the setup time of read operation.
 */

#define EFUSE_TSUR_A    0x000000FF
#define EFUSE_TSUR_A_M  (EFUSE_TSUR_A_V << EFUSE_TSUR_A_S)
#define EFUSE_TSUR_A_V  0x000000FF
#define EFUSE_TSUR_A_S  16

/* EFUSE_TRD : R/W; bitpos: [15:8]; default: 1;
 * Configures the length of pulse of read operation.
 */

#define EFUSE_TRD    0x000000FF
#define EFUSE_TRD_M  (EFUSE_TRD_V << EFUSE_TRD_S)
#define EFUSE_TRD_V  0x000000FF
#define EFUSE_TRD_S  8

/* EFUSE_THR_A : R/W; bitpos: [7:0]; default: 1;
 * Configures the hold time of read operation.
 */

#define EFUSE_THR_A    0x000000FF
#define EFUSE_THR_A_M  (EFUSE_THR_A_V << EFUSE_THR_A_S)
#define EFUSE_THR_A_V  0x000000FF
#define EFUSE_THR_A_S  0

/* EFUSE_WR_TIM_CONF0_REG register
 * Configuration register 0 of eFuse programming timing parameters.
 */

#define EFUSE_WR_TIM_CONF0_REG (DR_REG_EFUSE_BASE + 0x1f0)

/* EFUSE_TPGM : R/W; bitpos: [31:16]; default: 200;
 * Configures the length of pulse during programming 1 to eFuse.
 */

#define EFUSE_TPGM    0x0000FFFF
#define EFUSE_TPGM_M  (EFUSE_TPGM_V << EFUSE_TPGM_S)
#define EFUSE_TPGM_V  0x0000FFFF
#define EFUSE_TPGM_S  16

/* EFUSE_TPGM_INACTIVE : R/W; bitpos: [15:8]; default: 1;
 * Configures the length of pulse during programming 0 to eFuse.
 */

#define EFUSE_TPGM_INACTIVE    0x000000FF
#define EFUSE_TPGM_INACTIVE_M  (EFUSE_TPGM_INACTIVE_V << EFUSE_TPGM_INACTIVE_S)
#define EFUSE_TPGM_INACTIVE_V  0x000000FF
#define EFUSE_TPGM_INACTIVE_S  8

/* EFUSE_THP_A : R/W; bitpos: [7:0]; default: 1;
 * Configures the hold time of programming operation.
 */

