apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_efuse.h
#define EFUSE_THP_A    0x000000FF
#define EFUSE_THP_A_M  (EFUSE_THP_A_V << EFUSE_THP_A_S)
#define EFUSE_THP_A_V  0x000000FF
#define EFUSE_THP_A_S  0

/* EFUSE_WR_TIM_CONF1_REG register
 * Configuration register 1 of eFuse programming timing parameters.
 */

#define EFUSE_WR_TIM_CONF1_REG (DR_REG_EFUSE_BASE + 0x1f4)

/* EFUSE_PWR_ON_NUM : R/W; bitpos: [23:8]; default: 10368;
 * Configures the power up time for VDDQ.
 */

#define EFUSE_PWR_ON_NUM    0x0000FFFF
#define EFUSE_PWR_ON_NUM_M  (EFUSE_PWR_ON_NUM_V << EFUSE_PWR_ON_NUM_S)
#define EFUSE_PWR_ON_NUM_V  0x0000FFFF
#define EFUSE_PWR_ON_NUM_S  8

/* EFUSE_TSUP_A : R/W; bitpos: [7:0]; default: 1;
 * Configures the setup time of programming operation.
 */

#define EFUSE_TSUP_A    0x000000FF
#define EFUSE_TSUP_A_M  (EFUSE_TSUP_A_V << EFUSE_TSUP_A_S)
#define EFUSE_TSUP_A_V  0x000000FF
#define EFUSE_TSUP_A_S  0

/* EFUSE_WR_TIM_CONF2_REG register
 * Configuration register 2 of eFuse programming timing parameters.
 */

#define EFUSE_WR_TIM_CONF2_REG (DR_REG_EFUSE_BASE + 0x1f8)

/* EFUSE_PWR_OFF_NUM : R/W; bitpos: [15:0]; default: 400;
 * Configures the power outage time for VDDQ.
 */

#define EFUSE_PWR_OFF_NUM    0x0000FFFF
#define EFUSE_PWR_OFF_NUM_M  (EFUSE_PWR_OFF_NUM_V << EFUSE_PWR_OFF_NUM_S)
#define EFUSE_PWR_OFF_NUM_V  0x0000FFFF
#define EFUSE_PWR_OFF_NUM_S  0

/* EFUSE_DATE_REG register
 * eFuse version register.
 */

#define EFUSE_DATE_REG (DR_REG_EFUSE_BASE + 0x1fc)

/* EFUSE_EFUSE_DATE : R/W; bitpos: [31:0]; default: 419959040;
 * Stores eFuse version.
 */

#define EFUSE_EFUSE_DATE    0xFFFFFFFF
#define EFUSE_EFUSE_DATE_M  (EFUSE_EFUSE_DATE_V << EFUSE_EFUSE_DATE_S)
#define EFUSE_EFUSE_DATE_V  0xFFFFFFFF
#define EFUSE_EFUSE_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_EFUSE_H */
